#![allow(non_upper_case_globals)]
#![allow(non_camel_case_types)]
#![allow(non_snake_case)]
#![allow(deref_nullptr)]

/* automatically generated by rust-bindgen 0.59.2 */

pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const CHAR_BIT: u32 = 8;
pub const SCHAR_MIN: i32 = -128;
pub const SCHAR_MAX: u32 = 127;
pub const UCHAR_MAX: u32 = 255;
pub const CHAR_MIN: i32 = -128;
pub const CHAR_MAX: u32 = 127;
pub const MB_LEN_MAX: u32 = 5;
pub const SHRT_MIN: i32 = -32768;
pub const SHRT_MAX: u32 = 32767;
pub const USHRT_MAX: u32 = 65535;
pub const INT_MIN: i32 = -2147483648;
pub const INT_MAX: u32 = 2147483647;
pub const UINT_MAX: u32 = 4294967295;
pub const LONG_MIN: i32 = -2147483648;
pub const LONG_MAX: u32 = 2147483647;
pub const ULONG_MAX: u32 = 4294967295;
pub const _ARGMAX: u32 = 100;
pub const _CRT_INT_MAX: u32 = 2147483647;
pub const _CRT_FUNCTIONS_REQUIRED: u32 = 1;
pub const _CRT_HAS_CXX17: u32 = 0;
pub const _ARM_WINAPI_PARTITION_DESKTOP_SDK_AVAILABLE: u32 = 1;
pub const _CRT_BUILD_DESKTOP_APP: u32 = 1;
pub const _CRT_INTERNAL_NONSTDC_NAMES: u32 = 1;

pub const MATH_ERRNO: u32 = 1;
pub const MATH_ERREXCEPT: u32 = 2;
pub const math_errhandling: u32 = 3;
pub const _FE_DIVBYZERO: u32 = 4;
pub const _FE_INEXACT: u32 = 32;
pub const _FE_INVALID: u32 = 1;
pub const _FE_OVERFLOW: u32 = 8;
pub const _FE_UNDERFLOW: u32 = 16;
pub const _D0_C: u32 = 3;
pub const _D1_C: u32 = 2;
pub const _D2_C: u32 = 1;
pub const _D3_C: u32 = 0;
pub const _DBIAS: u32 = 1022;
pub const _DOFF: u32 = 4;
pub const _F0_C: u32 = 1;
pub const _F1_C: u32 = 0;
pub const _FBIAS: u32 = 126;
pub const _FOFF: u32 = 7;
pub const _FRND: u32 = 1;
pub const _L0_C: u32 = 3;
pub const _L1_C: u32 = 2;
pub const _L2_C: u32 = 1;
pub const _L3_C: u32 = 0;
pub const _LBIAS: u32 = 1022;
pub const _LOFF: u32 = 4;
pub const _FP_LT: u32 = 1;
pub const _FP_EQ: u32 = 2;
pub const _FP_GT: u32 = 4;
pub const DOMAIN: u32 = 1;
pub const SING: u32 = 2;
pub const OVERFLOW: u32 = 3;
pub const UNDERFLOW: u32 = 4;
pub const TLOSS: u32 = 5;
pub const PLOSS: u32 = 6;
pub const _NLSCMPERROR: u32 = 2147483647;
pub const WCHAR_MIN: u32 = 0;
pub const WCHAR_MAX: u32 = 65535;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 65535;
pub const LIBRAW_DEFAULT_ADJUST_MAXIMUM_THRESHOLD: f64 = 0.75;
pub const LIBRAW_DEFAULT_AUTO_BRIGHTNESS_THRESHOLD: f64 = 0.01;
pub const LIBRAW_MAX_ALLOC_MB_DEFAULT: u32 = 2048;
pub const LIBRAW_MAX_NONDNG_RAW_FILE_SIZE: u32 = 2147483647;
pub const LIBRAW_MAX_DNG_RAW_FILE_SIZE: u32 = 2147483647;
pub const LIBRAW_MAX_THUMBNAIL_MB: u32 = 512;
pub const LIBRAW_MAX_METADATA_BLOCKS: u32 = 1024;
pub const LIBRAW_CBLACK_SIZE: u32 = 4104;
pub const LIBRAW_IFD_MAXCOUNT: u32 = 10;
pub const LIBRAW_THUMBNAIL_MAXCOUNT: u32 = 8;
pub const LIBRAW_CRXTRACKS_MAXCOUNT: u32 = 16;
pub const LIBRAW_AFDATA_MAXCOUNT: u32 = 4;
pub const LIBRAW_AHD_TILE: u32 = 512;
pub const LIBRAW_LENS_NOT_SET: i32 = -1;
pub const LIBRAW_XTRANS: u32 = 9;
pub const LIBRAW_PROGRESS_THUMB_MASK: u32 = 268435455;
pub const LIBRAW_MAJOR_VERSION: u32 = 0;
pub const LIBRAW_MINOR_VERSION: u32 = 21;
pub const LIBRAW_PATCH_VERSION: u32 = 0;
pub const LIBRAW_SHLIB_CURRENT: u32 = 22;
pub const LIBRAW_SHLIB_REVISION: u32 = 0;
pub const LIBRAW_SHLIB_AGE: u32 = 0;
pub const LibRawBigEndian: u32 = 0;
pub const LIBRAW_HISTOGRAM_SIZE: u32 = 8192;
pub type va_list = *mut libc::c_char;
pub type __vcrt_bool = bool;
pub type wchar_t = libc::c_ushort;
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type __crt_bool = bool;
pub type errno_t = libc::c_int;
pub type wint_t = libc::c_ushort;
pub type wctype_t = libc::c_ushort;
pub type __time32_t = libc::c_long;
pub type __time64_t = libc::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const libc::c_ushort,
    pub _locale_mb_cur_max: libc::c_int,
    pub _locale_lc_codepage: libc::c_uint,
}
#[test]
fn bindgen_test_layout___crt_locale_data_public() {
    assert_eq!(
        ::core::mem::size_of::<__crt_locale_data_public>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        ::core::mem::align_of::<__crt_locale_data_public>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__crt_locale_data_public>()))._locale_pctype as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_pctype)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__crt_locale_data_public>()))._locale_mb_cur_max as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_mb_cur_max)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<__crt_locale_data_public>()))._locale_lc_codepage as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_lc_codepage)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[test]
fn bindgen_test_layout___crt_locale_pointers() {
    assert_eq!(
        ::core::mem::size_of::<__crt_locale_pointers>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        ::core::mem::align_of::<__crt_locale_pointers>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__crt_locale_pointers>())).locinfo as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_pointers),
            "::",
            stringify!(locinfo)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<__crt_locale_pointers>())).mbcinfo as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_pointers),
            "::",
            stringify!(mbcinfo)
        )
    );
}
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct _Mbstatet {
    pub _Wchar: libc::c_ulong,
    pub _Byte: libc::c_ushort,
    pub _State: libc::c_ushort,
}
#[test]
fn bindgen_test_layout__Mbstatet() {
    assert_eq!(
        ::core::mem::size_of::<_Mbstatet>(),
        8usize,
        concat!("Size of: ", stringify!(_Mbstatet))
    );
    assert_eq!(
        ::core::mem::align_of::<_Mbstatet>(),
        4usize,
        concat!("Alignment of ", stringify!(_Mbstatet))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_Mbstatet>()))._Wchar as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_Wchar)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_Mbstatet>()))._Byte as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_Byte)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_Mbstatet>()))._State as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_State)
        )
    );
}
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
extern "C" {
    pub fn memchr(
        _Buf: *const libc::c_void,
        _Val: libc::c_int,
        _MaxCount: libc::c_ulonglong,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn memcmp(
        _Buf1: *const libc::c_void,
        _Buf2: *const libc::c_void,
        _Size: libc::c_ulonglong,
    ) -> libc::c_int;
}
extern "C" {
    pub fn memcpy(
        _Dst: *mut libc::c_void,
        _Src: *const libc::c_void,
        _Size: libc::c_ulonglong,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn memmove(
        _Dst: *mut libc::c_void,
        _Src: *const libc::c_void,
        _Size: libc::c_ulonglong,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn memset(
        _Dst: *mut libc::c_void,
        _Val: libc::c_int,
        _Size: libc::c_ulonglong,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn strchr(_Str: *const libc::c_char, _Val: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn strrchr(_Str: *const libc::c_char, _Ch: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn strstr(_Str: *const libc::c_char, _SubStr: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn wcschr(_Str: *const libc::c_ushort, _Ch: libc::c_ushort) -> *mut libc::c_ushort;
}
extern "C" {
    pub fn wcsrchr(_Str: *const wchar_t, _Ch: wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsstr(_Str: *const wchar_t, _SubStr: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn memccpy(
        _Dst: *mut libc::c_void,
        _Src: *const libc::c_void,
        _Val: libc::c_int,
        _Size: libc::c_ulonglong,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn memicmp(
        _Buf1: *const libc::c_void,
        _Buf2: *const libc::c_void,
        _Size: usize,
    ) -> libc::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct _iobuf {
    pub _Placeholder: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout__iobuf() {
    assert_eq!(
        ::core::mem::size_of::<_iobuf>(),
        8usize,
        concat!("Size of: ", stringify!(_iobuf))
    );
    assert_eq!(
        ::core::mem::align_of::<_iobuf>(),
        8usize,
        concat!("Alignment of ", stringify!(_iobuf))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_iobuf>()))._Placeholder as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_iobuf),
            "::",
            stringify!(_Placeholder)
        )
    );
}
pub type FILE = _iobuf;
extern "C" {
    pub fn fgetwc(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn fputwc(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn getwc(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn getwchar() -> wint_t;
}
extern "C" {
    pub fn fgetws(
        _Buffer: *mut wchar_t,
        _BufferCount: libc::c_int,
        _Stream: *mut FILE,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn fputws(_Buffer: *const wchar_t, _Stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn putwc(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn putwchar(_Character: wchar_t) -> wint_t;
}
extern "C" {
    pub fn ungetwc(_Character: wint_t, _Stream: *mut FILE) -> wint_t;
}
pub type fpos_t = libc::c_longlong;
extern "C" {
    pub fn clearerr_s(_Stream: *mut FILE) -> errno_t;
}
extern "C" {
    pub fn fopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const libc::c_char,
        _Mode: *const libc::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn fread_s(
        _Buffer: *mut libc::c_void,
        _BufferSize: usize,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn freopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const libc::c_char,
        _Mode: *const libc::c_char,
        _OldStream: *mut FILE,
    ) -> errno_t;
}
extern "C" {
    pub fn gets_s(_Buffer: *mut libc::c_char, _Size: rsize_t) -> *mut libc::c_char;
}
extern "C" {
    pub fn tmpfile_s(_Stream: *mut *mut FILE) -> errno_t;
}
extern "C" {
    pub fn tmpnam_s(_Buffer: *mut libc::c_char, _Size: rsize_t) -> errno_t;
}
extern "C" {
    pub fn clearerr(_Stream: *mut FILE);
}
extern "C" {
    pub fn fclose(_Stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn feof(_Stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn ferror(_Stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fflush(_Stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fgetc(_Stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fgetpos(_Stream: *mut FILE, _Position: *mut fpos_t) -> libc::c_int;
}
extern "C" {
    pub fn fgets(
        _Buffer: *mut libc::c_char,
        _MaxCount: libc::c_int,
        _Stream: *mut FILE,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn fopen(_FileName: *const libc::c_char, _Mode: *const libc::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fputc(_Character: libc::c_int, _Stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fputs(_Buffer: *const libc::c_char, _Stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn fread(
        _Buffer: *mut libc::c_void,
        _ElementSize: libc::c_ulonglong,
        _ElementCount: libc::c_ulonglong,
        _Stream: *mut FILE,
    ) -> libc::c_ulonglong;
}
extern "C" {
    pub fn freopen(
        _FileName: *const libc::c_char,
        _Mode: *const libc::c_char,
        _Stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fsetpos(_Stream: *mut FILE, _Position: *const fpos_t) -> libc::c_int;
}
extern "C" {
    pub fn fseek(_Stream: *mut FILE, _Offset: libc::c_long, _Origin: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn ftell(_Stream: *mut FILE) -> libc::c_long;
}
extern "C" {
    pub fn fwrite(
        _Buffer: *const libc::c_void,
        _ElementSize: libc::c_ulonglong,
        _ElementCount: libc::c_ulonglong,
        _Stream: *mut FILE,
    ) -> libc::c_ulonglong;
}
extern "C" {
    pub fn getc(_Stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn getchar() -> libc::c_int;
}
extern "C" {
    pub fn perror(_ErrorMessage: *const libc::c_char);
}
extern "C" {
    pub fn putc(_Character: libc::c_int, _Stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn putchar(_Character: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn puts(_Buffer: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn remove(_FileName: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn rename(
        _OldFileName: *const libc::c_char,
        _NewFileName: *const libc::c_char,
    ) -> libc::c_int;
}
extern "C" {
    pub fn unlink(_FileName: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn rewind(_Stream: *mut FILE);
}
extern "C" {
    pub fn setbuf(_Stream: *mut FILE, _Buffer: *mut libc::c_char);
}
extern "C" {
    pub fn setvbuf(
        _Stream: *mut FILE,
        _Buffer: *mut libc::c_char,
        _Mode: libc::c_int,
        _Size: usize,
    ) -> libc::c_int;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(_Buffer: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn ungetc(_Character: libc::c_int, _Stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn tempnam(
        _Directory: *const libc::c_char,
        _FilePrefix: *const libc::c_char,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn fcloseall() -> libc::c_int;
}
extern "C" {
    pub fn fdopen(_FileHandle: libc::c_int, _Format: *const libc::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fgetchar() -> libc::c_int;
}
extern "C" {
    pub fn fileno(_Stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn flushall() -> libc::c_int;
}
extern "C" {
    pub fn fputchar(_Ch: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn getw(_Stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn putw(_Ch: libc::c_int, _Stream: *mut FILE) -> libc::c_int;
}
extern "C" {
    pub fn rmtmp() -> libc::c_int;
}
extern "C" {
    pub fn calloc(_Count: libc::c_ulonglong, _Size: libc::c_ulonglong) -> *mut libc::c_void;
}
extern "C" {
    pub fn free(_Block: *mut libc::c_void);
}
extern "C" {
    pub fn malloc(_Size: libc::c_ulonglong) -> *mut libc::c_void;
}
extern "C" {
    pub fn realloc(_Block: *mut libc::c_void, _Size: libc::c_ulonglong) -> *mut libc::c_void;
}
pub type max_align_t = f64;
pub type _CoreCrtSecureSearchSortCompareFunction = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *mut libc::c_void,
        arg2: *const libc::c_void,
        arg3: *const libc::c_void,
    ) -> libc::c_int,
>;
pub type _CoreCrtNonSecureSearchSortCompareFunction = ::core::option::Option<
    unsafe extern "C" fn(arg1: *const libc::c_void, arg2: *const libc::c_void) -> libc::c_int,
>;
extern "C" {
    pub fn bsearch_s(
        _Key: *const libc::c_void,
        _Base: *const libc::c_void,
        _NumOfElements: rsize_t,
        _SizeOfElements: rsize_t,
        _CompareFunction: _CoreCrtSecureSearchSortCompareFunction,
        _Context: *mut libc::c_void,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn qsort_s(
        _Base: *mut libc::c_void,
        _NumOfElements: rsize_t,
        _SizeOfElements: rsize_t,
        _CompareFunction: _CoreCrtSecureSearchSortCompareFunction,
        _Context: *mut libc::c_void,
    );
}
extern "C" {
    pub fn bsearch(
        _Key: *const libc::c_void,
        _Base: *const libc::c_void,
        _NumOfElements: usize,
        _SizeOfElements: usize,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn qsort(
        _Base: *mut libc::c_void,
        _NumOfElements: usize,
        _SizeOfElements: usize,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    );
}
extern "C" {
    pub fn lfind(
        _Key: *const libc::c_void,
        _Base: *const libc::c_void,
        _NumOfElements: *mut libc::c_uint,
        _SizeOfElements: libc::c_uint,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn lsearch(
        _Key: *const libc::c_void,
        _Base: *mut libc::c_void,
        _NumOfElements: *mut libc::c_uint,
        _SizeOfElements: libc::c_uint,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut libc::c_void;
}
extern "C" {
    pub fn wcstod(_String: *const wchar_t, _EndPtr: *mut *mut wchar_t) -> f64;
}
extern "C" {
    pub fn wcstol(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: libc::c_int,
    ) -> libc::c_long;
}
extern "C" {
    pub fn wcstoll(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: libc::c_int,
    ) -> libc::c_longlong;
}
extern "C" {
    pub fn wcstoul(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: libc::c_int,
    ) -> libc::c_ulong;
}
extern "C" {
    pub fn wcstoull(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: libc::c_int,
    ) -> libc::c_ulonglong;
}
extern "C" {
    pub fn wcstold(_String: *const wchar_t, _EndPtr: *mut *mut wchar_t) -> f64;
}
extern "C" {
    pub fn wcstof(_String: *const wchar_t, _EndPtr: *mut *mut wchar_t) -> f32;
}
extern "C" {
    pub fn exit(_Code: libc::c_int);
}
extern "C" {
    pub fn quick_exit(_Code: libc::c_int);
}
extern "C" {
    pub fn abort();
}
pub type _onexit_t = ::core::option::Option<unsafe extern "C" fn() -> libc::c_int>;
extern "C" {
    pub fn atexit(arg1: ::core::option::Option<unsafe extern "C" fn()>) -> libc::c_int;
}
extern "C" {
    pub fn at_quick_exit(arg1: ::core::option::Option<unsafe extern "C" fn()>) -> libc::c_int;
}
pub type _purecall_handler = ::core::option::Option<unsafe extern "C" fn()>;
pub type _invalid_parameter_handler = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *const wchar_t,
        arg2: *const wchar_t,
        arg3: *const wchar_t,
        arg4: libc::c_uint,
        arg5: usize,
    ),
>;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct _div_t {
    pub quot: libc::c_int,
    pub rem: libc::c_int,
}
#[test]
fn bindgen_test_layout__div_t() {
    assert_eq!(
        ::core::mem::size_of::<_div_t>(),
        8usize,
        concat!("Size of: ", stringify!(_div_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_div_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_div_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_div_t>())).rem as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_div_t),
            "::",
            stringify!(rem)
        )
    );
}
pub type div_t = _div_t;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct _ldiv_t {
    pub quot: libc::c_long,
    pub rem: libc::c_long,
}
#[test]
fn bindgen_test_layout__ldiv_t() {
    assert_eq!(
        ::core::mem::size_of::<_ldiv_t>(),
        8usize,
        concat!("Size of: ", stringify!(_ldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_ldiv_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_ldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_ldiv_t>())).rem as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
pub type ldiv_t = _ldiv_t;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct _lldiv_t {
    pub quot: libc::c_longlong,
    pub rem: libc::c_longlong,
}
#[test]
fn bindgen_test_layout__lldiv_t() {
    assert_eq!(
        ::core::mem::size_of::<_lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(_lldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_lldiv_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_lldiv_t>())).quot as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_lldiv_t>())).rem as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
pub type lldiv_t = _lldiv_t;
extern "C" {
    pub fn abs(_Number: libc::c_int) -> libc::c_int;
}
extern "C" {
    pub fn labs(_Number: libc::c_long) -> libc::c_long;
}
extern "C" {
    pub fn llabs(_Number: libc::c_longlong) -> libc::c_longlong;
}
extern "C" {
    pub fn div(_Numerator: libc::c_int, _Denominator: libc::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(_Numerator: libc::c_long, _Denominator: libc::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(_Numerator: libc::c_longlong, _Denominator: libc::c_longlong) -> lldiv_t;
}
extern "C" {
    pub fn srand(_Seed: libc::c_uint);
}
extern "C" {
    pub fn rand() -> libc::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct _LDOUBLE {
    pub ld: [libc::c_uchar; 10usize],
}
#[test]
fn bindgen_test_layout__LDOUBLE() {
    assert_eq!(
        ::core::mem::size_of::<_LDOUBLE>(),
        10usize,
        concat!("Size of: ", stringify!(_LDOUBLE))
    );
    assert_eq!(
        ::core::mem::align_of::<_LDOUBLE>(),
        1usize,
        concat!("Alignment of ", stringify!(_LDOUBLE))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_LDOUBLE>())).ld as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_LDOUBLE),
            "::",
            stringify!(ld)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct _CRT_DOUBLE {
    pub x: f64,
}
#[test]
fn bindgen_test_layout__CRT_DOUBLE() {
    assert_eq!(
        ::core::mem::size_of::<_CRT_DOUBLE>(),
        8usize,
        concat!("Size of: ", stringify!(_CRT_DOUBLE))
    );
    assert_eq!(
        ::core::mem::align_of::<_CRT_DOUBLE>(),
        8usize,
        concat!("Alignment of ", stringify!(_CRT_DOUBLE))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_CRT_DOUBLE>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CRT_DOUBLE),
            "::",
            stringify!(x)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct _CRT_FLOAT {
    pub f: f32,
}
#[test]
fn bindgen_test_layout__CRT_FLOAT() {
    assert_eq!(
        ::core::mem::size_of::<_CRT_FLOAT>(),
        4usize,
        concat!("Size of: ", stringify!(_CRT_FLOAT))
    );
    assert_eq!(
        ::core::mem::align_of::<_CRT_FLOAT>(),
        4usize,
        concat!("Alignment of ", stringify!(_CRT_FLOAT))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_CRT_FLOAT>())).f as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CRT_FLOAT),
            "::",
            stringify!(f)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct _LONGDOUBLE {
    pub x: f64,
}
#[test]
fn bindgen_test_layout__LONGDOUBLE() {
    assert_eq!(
        ::core::mem::size_of::<_LONGDOUBLE>(),
        8usize,
        concat!("Size of: ", stringify!(_LONGDOUBLE))
    );
    assert_eq!(
        ::core::mem::align_of::<_LONGDOUBLE>(),
        8usize,
        concat!("Alignment of ", stringify!(_LONGDOUBLE))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_LONGDOUBLE>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_LONGDOUBLE),
            "::",
            stringify!(x)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct _LDBL12 {
    pub ld12: [libc::c_uchar; 12usize],
}
#[test]
fn bindgen_test_layout__LDBL12() {
    assert_eq!(
        ::core::mem::size_of::<_LDBL12>(),
        12usize,
        concat!("Size of: ", stringify!(_LDBL12))
    );
    assert_eq!(
        ::core::mem::align_of::<_LDBL12>(),
        1usize,
        concat!("Alignment of ", stringify!(_LDBL12))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_LDBL12>())).ld12 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_LDBL12),
            "::",
            stringify!(ld12)
        )
    );
}
extern "C" {
    pub fn atof(_String: *const libc::c_char) -> f64;
}
extern "C" {
    pub fn atoi(_String: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn atol(_String: *const libc::c_char) -> libc::c_long;
}
extern "C" {
    pub fn atoll(_String: *const libc::c_char) -> libc::c_longlong;
}
extern "C" {
    pub fn strtof(_String: *const libc::c_char, _EndPtr: *mut *mut libc::c_char) -> f32;
}
extern "C" {
    pub fn strtod(_String: *const libc::c_char, _EndPtr: *mut *mut libc::c_char) -> f64;
}
extern "C" {
    pub fn strtol(
        _String: *const libc::c_char,
        _EndPtr: *mut *mut libc::c_char,
        _Radix: libc::c_int,
    ) -> libc::c_long;
}
extern "C" {
    pub fn strtoll(
        _String: *const libc::c_char,
        _EndPtr: *mut *mut libc::c_char,
        _Radix: libc::c_int,
    ) -> libc::c_longlong;
}
extern "C" {
    pub fn strtoul(
        _String: *const libc::c_char,
        _EndPtr: *mut *mut libc::c_char,
        _Radix: libc::c_int,
    ) -> libc::c_ulong;
}
extern "C" {
    pub fn strtoull(
        _String: *const libc::c_char,
        _EndPtr: *mut *mut libc::c_char,
        _Radix: libc::c_int,
    ) -> libc::c_ulonglong;
}
extern "C" {
    pub fn mblen(_Ch: *const libc::c_char, _MaxCount: usize) -> libc::c_int;
}
extern "C" {
    pub fn mbtowc(
        _DstCh: *mut wchar_t,
        _SrcCh: *const libc::c_char,
        _SrcSizeInBytes: usize,
    ) -> libc::c_int;
}
extern "C" {
    pub fn mbstowcs_s(
        _PtNumOfCharConverted: *mut usize,
        _DstBuf: *mut wchar_t,
        _SizeInWords: usize,
        _SrcBuf: *const libc::c_char,
        _MaxCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn mbstowcs(_Dest: *mut wchar_t, _Source: *const libc::c_char, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn wctomb(_MbCh: *mut libc::c_char, _WCh: wchar_t) -> libc::c_int;
}
extern "C" {
    pub fn wctomb_s(
        _SizeConverted: *mut libc::c_int,
        _MbCh: *mut libc::c_char,
        _SizeInBytes: rsize_t,
        _WCh: wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcstombs_s(
        _PtNumOfCharConverted: *mut usize,
        _Dst: *mut libc::c_char,
        _DstSizeInBytes: usize,
        _Src: *const wchar_t,
        _MaxCountInBytes: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn wcstombs(_Dest: *mut libc::c_char, _Source: *const wchar_t, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn getenv_s(
        _RequiredCount: *mut usize,
        _Buffer: *mut libc::c_char,
        _BufferCount: rsize_t,
        _VarName: *const libc::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn getenv(_VarName: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn system(_Command: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn ecvt(
        _Value: f64,
        _DigitCount: libc::c_int,
        _PtDec: *mut libc::c_int,
        _PtSign: *mut libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn fcvt(
        _Value: f64,
        _FractionalDigitCount: libc::c_int,
        _PtDec: *mut libc::c_int,
        _PtSign: *mut libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn gcvt(
        _Value: f64,
        _DigitCount: libc::c_int,
        _DstBuf: *mut libc::c_char,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn itoa(
        _Value: libc::c_int,
        _Buffer: *mut libc::c_char,
        _Radix: libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn ltoa(
        _Value: libc::c_long,
        _Buffer: *mut libc::c_char,
        _Radix: libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn swab(_Buf1: *mut libc::c_char, _Buf2: *mut libc::c_char, _SizeInBytes: libc::c_int);
}
extern "C" {
    pub fn ultoa(
        _Value: libc::c_ulong,
        _Buffer: *mut libc::c_char,
        _Radix: libc::c_int,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn putenv(_EnvString: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn onexit(_Func: _onexit_t) -> _onexit_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct _exception {
    pub type_: libc::c_int,
    pub name: *mut libc::c_char,
    pub arg1: f64,
    pub arg2: f64,
    pub retval: f64,
}
#[test]
fn bindgen_test_layout__exception() {
    assert_eq!(
        ::core::mem::size_of::<_exception>(),
        40usize,
        concat!("Size of: ", stringify!(_exception))
    );
    assert_eq!(
        ::core::mem::align_of::<_exception>(),
        8usize,
        concat!("Alignment of ", stringify!(_exception))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_exception>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_exception),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_exception>())).name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_exception),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_exception>())).arg1 as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_exception),
            "::",
            stringify!(arg1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_exception>())).arg2 as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_exception),
            "::",
            stringify!(arg2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_exception>())).retval as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_exception),
            "::",
            stringify!(retval)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct _complex {
    pub x: f64,
    pub y: f64,
}
#[test]
fn bindgen_test_layout__complex() {
    assert_eq!(
        ::core::mem::size_of::<_complex>(),
        16usize,
        concat!("Size of: ", stringify!(_complex))
    );
    assert_eq!(
        ::core::mem::align_of::<_complex>(),
        8usize,
        concat!("Alignment of ", stringify!(_complex))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_complex>())).x as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_complex),
            "::",
            stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_complex>())).y as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_complex),
            "::",
            stringify!(y)
        )
    );
}
pub type float_t = f32;
pub type double_t = f64;
extern "C" {
    pub static _HUGE: f64;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _double_val {
    pub _Sh: [libc::c_ushort; 4usize],
    pub _Val: f64,
}
#[test]
fn bindgen_test_layout__double_val() {
    assert_eq!(
        ::core::mem::size_of::<_double_val>(),
        8usize,
        concat!("Size of: ", stringify!(_double_val))
    );
    assert_eq!(
        ::core::mem::align_of::<_double_val>(),
        8usize,
        concat!("Alignment of ", stringify!(_double_val))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_double_val>()))._Sh as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_double_val),
            "::",
            stringify!(_Sh)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_double_val>()))._Val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_double_val),
            "::",
            stringify!(_Val)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _float_val {
    pub _Sh: [libc::c_ushort; 2usize],
    pub _Val: f32,
}
#[test]
fn bindgen_test_layout__float_val() {
    assert_eq!(
        ::core::mem::size_of::<_float_val>(),
        4usize,
        concat!("Size of: ", stringify!(_float_val))
    );
    assert_eq!(
        ::core::mem::align_of::<_float_val>(),
        4usize,
        concat!("Alignment of ", stringify!(_float_val))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_float_val>()))._Sh as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_float_val),
            "::",
            stringify!(_Sh)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_float_val>()))._Val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_float_val),
            "::",
            stringify!(_Val)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _ldouble_val {
    pub _Sh: [libc::c_ushort; 4usize],
    pub _Val: f64,
}
#[test]
fn bindgen_test_layout__ldouble_val() {
    assert_eq!(
        ::core::mem::size_of::<_ldouble_val>(),
        8usize,
        concat!("Size of: ", stringify!(_ldouble_val))
    );
    assert_eq!(
        ::core::mem::align_of::<_ldouble_val>(),
        8usize,
        concat!("Alignment of ", stringify!(_ldouble_val))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_ldouble_val>()))._Sh as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ldouble_val),
            "::",
            stringify!(_Sh)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_ldouble_val>()))._Val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ldouble_val),
            "::",
            stringify!(_Val)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union _float_const {
    pub _Word: [libc::c_ushort; 4usize],
    pub _Float: f32,
    pub _Double: f64,
    pub _Long_double: f64,
}
#[test]
fn bindgen_test_layout__float_const() {
    assert_eq!(
        ::core::mem::size_of::<_float_const>(),
        8usize,
        concat!("Size of: ", stringify!(_float_const))
    );
    assert_eq!(
        ::core::mem::align_of::<_float_const>(),
        8usize,
        concat!("Alignment of ", stringify!(_float_const))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_float_const>()))._Word as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_float_const),
            "::",
            stringify!(_Word)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_float_const>()))._Float as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_float_const),
            "::",
            stringify!(_Float)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_float_const>()))._Double as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_float_const),
            "::",
            stringify!(_Double)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<_float_const>()))._Long_double as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_float_const),
            "::",
            stringify!(_Long_double)
        )
    );
}
extern "C" {
    pub static _Denorm_C: _float_const;
}
extern "C" {
    pub static _Inf_C: _float_const;
}
extern "C" {
    pub static _Nan_C: _float_const;
}
extern "C" {
    pub static _Snan_C: _float_const;
}
extern "C" {
    pub static _Hugeval_C: _float_const;
}
extern "C" {
    pub static _FDenorm_C: _float_const;
}
extern "C" {
    pub static _FInf_C: _float_const;
}
extern "C" {
    pub static _FNan_C: _float_const;
}
extern "C" {
    pub static _FSnan_C: _float_const;
}
extern "C" {
    pub static _LDenorm_C: _float_const;
}
extern "C" {
    pub static _LInf_C: _float_const;
}
extern "C" {
    pub static _LNan_C: _float_const;
}
extern "C" {
    pub static _LSnan_C: _float_const;
}
extern "C" {
    pub static _Eps_C: _float_const;
}
extern "C" {
    pub static _Rteps_C: _float_const;
}
extern "C" {
    pub static _FEps_C: _float_const;
}
extern "C" {
    pub static _FRteps_C: _float_const;
}
extern "C" {
    pub static _LEps_C: _float_const;
}
extern "C" {
    pub static _LRteps_C: _float_const;
}
extern "C" {
    pub static _Zero_C: f64;
}
extern "C" {
    pub static _Xbig_C: f64;
}
extern "C" {
    pub static _FZero_C: f32;
}
extern "C" {
    pub static _FXbig_C: f32;
}
extern "C" {
    pub static _LZero_C: f64;
}
extern "C" {
    pub static _LXbig_C: f64;
}
extern "C" {
    pub fn acos(_X: f64) -> f64;
}
extern "C" {
    pub fn asin(_X: f64) -> f64;
}
extern "C" {
    pub fn atan(_X: f64) -> f64;
}
extern "C" {
    pub fn atan2(_Y: f64, _X: f64) -> f64;
}
extern "C" {
    pub fn cos(_X: f64) -> f64;
}
extern "C" {
    pub fn cosh(_X: f64) -> f64;
}
extern "C" {
    pub fn exp(_X: f64) -> f64;
}
extern "C" {
    pub fn fabs(_X: f64) -> f64;
}
extern "C" {
    pub fn fmod(_X: f64, _Y: f64) -> f64;
}
extern "C" {
    pub fn log(_X: f64) -> f64;
}
extern "C" {
    pub fn log10(_X: f64) -> f64;
}
extern "C" {
    pub fn pow(_X: f64, _Y: f64) -> f64;
}
extern "C" {
    pub fn sin(_X: f64) -> f64;
}
extern "C" {
    pub fn sinh(_X: f64) -> f64;
}
extern "C" {
    pub fn sqrt(_X: f64) -> f64;
}
extern "C" {
    pub fn tan(_X: f64) -> f64;
}
extern "C" {
    pub fn tanh(_X: f64) -> f64;
}
extern "C" {
    pub fn acosh(_X: f64) -> f64;
}
extern "C" {
    pub fn asinh(_X: f64) -> f64;
}
extern "C" {
    pub fn atanh(_X: f64) -> f64;
}
extern "C" {
    pub fn cbrt(_X: f64) -> f64;
}
extern "C" {
    pub fn ceil(_X: f64) -> f64;
}
extern "C" {
    pub fn copysign(_Number: f64, _Sign: f64) -> f64;
}
extern "C" {
    pub fn erf(_X: f64) -> f64;
}
extern "C" {
    pub fn erfc(_X: f64) -> f64;
}
extern "C" {
    pub fn exp2(_X: f64) -> f64;
}
extern "C" {
    pub fn expm1(_X: f64) -> f64;
}
extern "C" {
    pub fn fdim(_X: f64, _Y: f64) -> f64;
}
extern "C" {
    pub fn floor(_X: f64) -> f64;
}
extern "C" {
    pub fn fma(_X: f64, _Y: f64, _Z: f64) -> f64;
}
extern "C" {
    pub fn fmax(_X: f64, _Y: f64) -> f64;
}
extern "C" {
    pub fn fmin(_X: f64, _Y: f64) -> f64;
}
extern "C" {
    pub fn frexp(_X: f64, _Y: *mut libc::c_int) -> f64;
}
extern "C" {
    pub fn hypot(_X: f64, _Y: f64) -> f64;
}
extern "C" {
    pub fn ilogb(_X: f64) -> libc::c_int;
}
extern "C" {
    pub fn ldexp(_X: f64, _Y: libc::c_int) -> f64;
}
extern "C" {
    pub fn lgamma(_X: f64) -> f64;
}
extern "C" {
    pub fn llrint(_X: f64) -> libc::c_longlong;
}
extern "C" {
    pub fn llround(_X: f64) -> libc::c_longlong;
}
extern "C" {
    pub fn log1p(_X: f64) -> f64;
}
extern "C" {
    pub fn log2(_X: f64) -> f64;
}
extern "C" {
    pub fn logb(_X: f64) -> f64;
}
extern "C" {
    pub fn lrint(_X: f64) -> libc::c_long;
}
extern "C" {
    pub fn lround(_X: f64) -> libc::c_long;
}
extern "C" {
    pub fn modf(_X: f64, _Y: *mut f64) -> f64;
}
extern "C" {
    pub fn nan(_X: *const libc::c_char) -> f64;
}
extern "C" {
    pub fn nearbyint(_X: f64) -> f64;
}
extern "C" {
    pub fn nextafter(_X: f64, _Y: f64) -> f64;
}
extern "C" {
    pub fn remainder(_X: f64, _Y: f64) -> f64;
}
extern "C" {
    pub fn remquo(_X: f64, _Y: f64, _Z: *mut libc::c_int) -> f64;
}
extern "C" {
    pub fn rint(_X: f64) -> f64;
}
extern "C" {
    pub fn round(_X: f64) -> f64;
}
extern "C" {
    pub fn scalbln(_X: f64, _Y: libc::c_long) -> f64;
}
extern "C" {
    pub fn scalbn(_X: f64, _Y: libc::c_int) -> f64;
}
extern "C" {
    pub fn tgamma(_X: f64) -> f64;
}
extern "C" {
    pub fn trunc(_X: f64) -> f64;
}
extern "C" {
    pub fn acoshf(_X: f32) -> f32;
}
extern "C" {
    pub fn asinhf(_X: f32) -> f32;
}
extern "C" {
    pub fn atanhf(_X: f32) -> f32;
}
extern "C" {
    pub fn cbrtf(_X: f32) -> f32;
}
extern "C" {
    pub fn copysignf(_Number: f32, _Sign: f32) -> f32;
}
extern "C" {
    pub fn erff(_X: f32) -> f32;
}
extern "C" {
    pub fn erfcf(_X: f32) -> f32;
}
extern "C" {
    pub fn expm1f(_X: f32) -> f32;
}
extern "C" {
    pub fn exp2f(_X: f32) -> f32;
}
extern "C" {
    pub fn fdimf(_X: f32, _Y: f32) -> f32;
}
extern "C" {
    pub fn fmaf(_X: f32, _Y: f32, _Z: f32) -> f32;
}
extern "C" {
    pub fn fmaxf(_X: f32, _Y: f32) -> f32;
}
extern "C" {
    pub fn fminf(_X: f32, _Y: f32) -> f32;
}
extern "C" {
    pub fn ilogbf(_X: f32) -> libc::c_int;
}
extern "C" {
    pub fn lgammaf(_X: f32) -> f32;
}
extern "C" {
    pub fn llrintf(_X: f32) -> libc::c_longlong;
}
extern "C" {
    pub fn llroundf(_X: f32) -> libc::c_longlong;
}
extern "C" {
    pub fn log1pf(_X: f32) -> f32;
}
extern "C" {
    pub fn log2f(_X: f32) -> f32;
}
extern "C" {
    pub fn logbf(_X: f32) -> f32;
}
extern "C" {
    pub fn lrintf(_X: f32) -> libc::c_long;
}
extern "C" {
    pub fn lroundf(_X: f32) -> libc::c_long;
}
extern "C" {
    pub fn nanf(_X: *const libc::c_char) -> f32;
}
extern "C" {
    pub fn nearbyintf(_X: f32) -> f32;
}
extern "C" {
    pub fn nextafterf(_X: f32, _Y: f32) -> f32;
}
extern "C" {
    pub fn remainderf(_X: f32, _Y: f32) -> f32;
}
extern "C" {
    pub fn remquof(_X: f32, _Y: f32, _Z: *mut libc::c_int) -> f32;
}
extern "C" {
    pub fn rintf(_X: f32) -> f32;
}
extern "C" {
    pub fn roundf(_X: f32) -> f32;
}
extern "C" {
    pub fn scalblnf(_X: f32, _Y: libc::c_long) -> f32;
}
extern "C" {
    pub fn scalbnf(_X: f32, _Y: libc::c_int) -> f32;
}
extern "C" {
    pub fn tgammaf(_X: f32) -> f32;
}
extern "C" {
    pub fn truncf(_X: f32) -> f32;
}
extern "C" {
    pub fn acosf(_X: f32) -> f32;
}
extern "C" {
    pub fn asinf(_X: f32) -> f32;
}
extern "C" {
    pub fn atan2f(_Y: f32, _X: f32) -> f32;
}
extern "C" {
    pub fn atanf(_X: f32) -> f32;
}
extern "C" {
    pub fn ceilf(_X: f32) -> f32;
}
extern "C" {
    pub fn cosf(_X: f32) -> f32;
}
extern "C" {
    pub fn coshf(_X: f32) -> f32;
}
extern "C" {
    pub fn expf(_X: f32) -> f32;
}
extern "C" {
    pub fn floorf(_X: f32) -> f32;
}
extern "C" {
    pub fn fmodf(_X: f32, _Y: f32) -> f32;
}
extern "C" {
    pub fn log10f(_X: f32) -> f32;
}
extern "C" {
    pub fn logf(_X: f32) -> f32;
}
extern "C" {
    pub fn modff(_X: f32, _Y: *mut f32) -> f32;
}
extern "C" {
    pub fn powf(_X: f32, _Y: f32) -> f32;
}
extern "C" {
    pub fn sinf(_X: f32) -> f32;
}
extern "C" {
    pub fn sinhf(_X: f32) -> f32;
}
extern "C" {
    pub fn sqrtf(_X: f32) -> f32;
}
extern "C" {
    pub fn tanf(_X: f32) -> f32;
}
extern "C" {
    pub fn tanhf(_X: f32) -> f32;
}
extern "C" {
    pub static mut HUGE: f64;
}
extern "C" {
    pub fn j0(_X: f64) -> f64;
}
extern "C" {
    pub fn j1(_X: f64) -> f64;
}
extern "C" {
    pub fn jn(_X: libc::c_int, _Y: f64) -> f64;
}
extern "C" {
    pub fn y0(_X: f64) -> f64;
}
extern "C" {
    pub fn y1(_X: f64) -> f64;
}
extern "C" {
    pub fn yn(_X: libc::c_int, _Y: f64) -> f64;
}
pub type _ino_t = libc::c_ushort;
pub type ino_t = _ino_t;
pub type _dev_t = libc::c_uint;
pub type dev_t = _dev_t;
pub type _off_t = libc::c_long;
pub type off_t = _off_t;
extern "C" {
    pub fn wcscat_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcscpy_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcsncat_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcsncpy_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcstok_s(
        _String: *mut wchar_t,
        _Delimiter: *const wchar_t,
        _Context: *mut *mut wchar_t,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscat(_Destination: *mut wchar_t, _Source: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscmp(_String1: *const libc::c_ushort, _String2: *const libc::c_ushort) -> libc::c_int;
}
extern "C" {
    pub fn wcscpy(_Destination: *mut wchar_t, _Source: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscspn(_String: *const wchar_t, _Control: *const wchar_t) -> usize;
}
extern "C" {
    pub fn wcslen(_String: *const libc::c_ushort) -> libc::c_ulonglong;
}
extern "C" {
    pub fn wcsnlen(_Source: *const wchar_t, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn wcsncat(
        _Destination: *mut wchar_t,
        _Source: *const wchar_t,
        _Count: usize,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsncmp(
        _String1: *const libc::c_ushort,
        _String2: *const libc::c_ushort,
        _MaxCount: libc::c_ulonglong,
    ) -> libc::c_int;
}
extern "C" {
    pub fn wcsncpy(
        _Destination: *mut wchar_t,
        _Source: *const wchar_t,
        _Count: usize,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn wcspbrk(_String: *const wchar_t, _Control: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsspn(_String: *const wchar_t, _Control: *const wchar_t) -> usize;
}
extern "C" {
    pub fn wcstok(
        _String: *mut wchar_t,
        _Delimiter: *const wchar_t,
        _Context: *mut *mut wchar_t,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsxfrm(_Destination: *mut wchar_t, _Source: *const wchar_t, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn wcscoll(_String1: *const wchar_t, _String2: *const wchar_t) -> libc::c_int;
}
extern "C" {
    pub fn wcsdup(_String: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsicmp(_String1: *const wchar_t, _String2: *const wchar_t) -> libc::c_int;
}
extern "C" {
    pub fn wcsnicmp(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> libc::c_int;
}
extern "C" {
    pub fn wcsnset(_String: *mut wchar_t, _Value: wchar_t, _MaxCount: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsrev(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsset(_String: *mut wchar_t, _Value: wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcslwr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsupr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsicoll(_String1: *const wchar_t, _String2: *const wchar_t) -> libc::c_int;
}
extern "C" {
    pub fn strcpy_s(
        _Destination: *mut libc::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const libc::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn strcat_s(
        _Destination: *mut libc::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const libc::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn strerror_s(
        _Buffer: *mut libc::c_char,
        _SizeInBytes: usize,
        _ErrorNumber: libc::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn strncat_s(
        _Destination: *mut libc::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const libc::c_char,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn strncpy_s(
        _Destination: *mut libc::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const libc::c_char,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn strtok_s(
        _String: *mut libc::c_char,
        _Delimiter: *const libc::c_char,
        _Context: *mut *mut libc::c_char,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn strcat(
        _Destination: *mut libc::c_char,
        _Source: *const libc::c_char,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn strcmp(_Str1: *const libc::c_char, _Str2: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn strcoll(_String1: *const libc::c_char, _String2: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn strcpy(
        _Destination: *mut libc::c_char,
        _Source: *const libc::c_char,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn strcspn(_Str: *const libc::c_char, _Control: *const libc::c_char) -> libc::c_ulonglong;
}
extern "C" {
    pub fn strerror(_ErrorMessage: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn strlen(_Str: *const libc::c_char) -> libc::c_ulonglong;
}
extern "C" {
    pub fn strncat(
        _Destination: *mut libc::c_char,
        _Source: *const libc::c_char,
        _Count: libc::c_ulonglong,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn strncmp(
        _Str1: *const libc::c_char,
        _Str2: *const libc::c_char,
        _MaxCount: libc::c_ulonglong,
    ) -> libc::c_int;
}
extern "C" {
    pub fn strncpy(
        _Destination: *mut libc::c_char,
        _Source: *const libc::c_char,
        _Count: libc::c_ulonglong,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn strnlen(_String: *const libc::c_char, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn strpbrk(_Str: *const libc::c_char, _Control: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn strspn(_Str: *const libc::c_char, _Control: *const libc::c_char) -> libc::c_ulonglong;
}
extern "C" {
    pub fn strtok(_String: *mut libc::c_char, _Delimiter: *const libc::c_char)
        -> *mut libc::c_char;
}
extern "C" {
    pub fn strxfrm(
        _Destination: *mut libc::c_char,
        _Source: *const libc::c_char,
        _MaxCount: libc::c_ulonglong,
    ) -> libc::c_ulonglong;
}
extern "C" {
    pub fn strdup(_String: *const libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn strcmpi(_String1: *const libc::c_char, _String2: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn stricmp(_String1: *const libc::c_char, _String2: *const libc::c_char) -> libc::c_int;
}
extern "C" {
    pub fn strlwr(_String: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn strnicmp(
        _String1: *const libc::c_char,
        _String2: *const libc::c_char,
        _MaxCount: usize,
    ) -> libc::c_int;
}
extern "C" {
    pub fn strnset(
        _String: *mut libc::c_char,
        _Value: libc::c_int,
        _MaxCount: usize,
    ) -> *mut libc::c_char;
}
extern "C" {
    pub fn strrev(_String: *mut libc::c_char) -> *mut libc::c_char;
}
extern "C" {
    pub fn strset(_String: *mut libc::c_char, _Value: libc::c_int) -> *mut libc::c_char;
}
extern "C" {
    pub fn strupr(_String: *mut libc::c_char) -> *mut libc::c_char;
}
pub type int_least8_t = libc::c_schar;
pub type int_least16_t = libc::c_short;
pub type int_least32_t = libc::c_int;
pub type int_least64_t = libc::c_longlong;
pub type uint_least8_t = libc::c_uchar;
pub type uint_least16_t = libc::c_ushort;
pub type uint_least32_t = libc::c_uint;
pub type uint_least64_t = libc::c_ulonglong;
pub type int_fast8_t = libc::c_schar;
pub type int_fast16_t = libc::c_int;
pub type int_fast32_t = libc::c_int;
pub type int_fast64_t = libc::c_longlong;
pub type uint_fast8_t = libc::c_uchar;
pub type uint_fast16_t = libc::c_uint;
pub type uint_fast32_t = libc::c_uint;
pub type uint_fast64_t = libc::c_ulonglong;
pub type intmax_t = libc::c_longlong;
pub type uintmax_t = libc::c_ulonglong;
pub const LibRaw_openbayer_patterns_LIBRAW_OPENBAYER_RGGB: LibRaw_openbayer_patterns = 148;
pub const LibRaw_openbayer_patterns_LIBRAW_OPENBAYER_BGGR: LibRaw_openbayer_patterns = 22;
pub const LibRaw_openbayer_patterns_LIBRAW_OPENBAYER_GRBG: LibRaw_openbayer_patterns = 97;
pub const LibRaw_openbayer_patterns_LIBRAW_OPENBAYER_GBRG: LibRaw_openbayer_patterns = 73;
pub type LibRaw_openbayer_patterns = libc::c_int;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_FORWARDMATRIX: LibRaw_dngfields_marks = 1;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_ILLUMINANT: LibRaw_dngfields_marks = 2;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_COLORMATRIX: LibRaw_dngfields_marks = 4;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_CALIBRATION: LibRaw_dngfields_marks = 8;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_ANALOGBALANCE: LibRaw_dngfields_marks = 16;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_BLACK: LibRaw_dngfields_marks = 32;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_WHITE: LibRaw_dngfields_marks = 64;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_OPCODE2: LibRaw_dngfields_marks = 128;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_LINTABLE: LibRaw_dngfields_marks = 256;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_CROPORIGIN: LibRaw_dngfields_marks = 512;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_CROPSIZE: LibRaw_dngfields_marks = 1024;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_PREVIEWCS: LibRaw_dngfields_marks = 2048;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_ASSHOTNEUTRAL: LibRaw_dngfields_marks = 4096;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_BASELINEEXPOSURE: LibRaw_dngfields_marks = 8192;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_LINEARRESPONSELIMIT: LibRaw_dngfields_marks = 16384;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_USERCROP: LibRaw_dngfields_marks = 32768;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_OPCODE1: LibRaw_dngfields_marks = 65536;
pub const LibRaw_dngfields_marks_LIBRAW_DNGFM_OPCODE3: LibRaw_dngfields_marks = 131072;
pub type LibRaw_dngfields_marks = libc::c_int;
pub const LibRaw_As_Shot_WB_Applied_codes_LIBRAW_ASWB_APPLIED: LibRaw_As_Shot_WB_Applied_codes = 1;
pub const LibRaw_As_Shot_WB_Applied_codes_LIBRAW_ASWB_CANON: LibRaw_As_Shot_WB_Applied_codes = 2;
pub const LibRaw_As_Shot_WB_Applied_codes_LIBRAW_ASWB_NIKON: LibRaw_As_Shot_WB_Applied_codes = 4;
pub const LibRaw_As_Shot_WB_Applied_codes_LIBRAW_ASWB_NIKON_SRAW: LibRaw_As_Shot_WB_Applied_codes =
    8;
pub const LibRaw_As_Shot_WB_Applied_codes_LIBRAW_ASWB_PENTAX: LibRaw_As_Shot_WB_Applied_codes = 16;
pub type LibRaw_As_Shot_WB_Applied_codes = libc::c_int;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_UNKNOWN: LibRaw_ExifTagTypes = 0;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_BYTE: LibRaw_ExifTagTypes = 1;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_ASCII: LibRaw_ExifTagTypes = 2;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SHORT: LibRaw_ExifTagTypes = 3;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_LONG: LibRaw_ExifTagTypes = 4;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_RATIONAL: LibRaw_ExifTagTypes = 5;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SBYTE: LibRaw_ExifTagTypes = 6;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_UNDEFINED: LibRaw_ExifTagTypes = 7;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SSHORT: LibRaw_ExifTagTypes = 8;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SLONG: LibRaw_ExifTagTypes = 9;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SRATIONAL: LibRaw_ExifTagTypes = 10;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_FLOAT: LibRaw_ExifTagTypes = 11;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_DOUBLE: LibRaw_ExifTagTypes = 12;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_IFD: LibRaw_ExifTagTypes = 13;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_UNICODE: LibRaw_ExifTagTypes = 14;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_COMPLEX: LibRaw_ExifTagTypes = 15;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_LONG8: LibRaw_ExifTagTypes = 16;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_SLONG8: LibRaw_ExifTagTypes = 17;
pub const LibRaw_ExifTagTypes_LIBRAW_EXIFTAG_TYPE_IFD8: LibRaw_ExifTagTypes = 18;
pub type LibRaw_ExifTagTypes = libc::c_int;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Unknown: LibRaw_whitebalance_code = 0;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Daylight: LibRaw_whitebalance_code = 1;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Fluorescent: LibRaw_whitebalance_code = 2;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Tungsten: LibRaw_whitebalance_code = 3;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Flash: LibRaw_whitebalance_code = 4;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FineWeather: LibRaw_whitebalance_code = 9;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Cloudy: LibRaw_whitebalance_code = 10;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Shade: LibRaw_whitebalance_code = 11;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FL_D: LibRaw_whitebalance_code = 12;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FL_N: LibRaw_whitebalance_code = 13;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FL_W: LibRaw_whitebalance_code = 14;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FL_WW: LibRaw_whitebalance_code = 15;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FL_L: LibRaw_whitebalance_code = 16;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Ill_A: LibRaw_whitebalance_code = 17;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Ill_B: LibRaw_whitebalance_code = 18;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Ill_C: LibRaw_whitebalance_code = 19;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_D55: LibRaw_whitebalance_code = 20;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_D65: LibRaw_whitebalance_code = 21;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_D75: LibRaw_whitebalance_code = 22;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_D50: LibRaw_whitebalance_code = 23;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_StudioTungsten: LibRaw_whitebalance_code = 24;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Sunset: LibRaw_whitebalance_code = 64;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Underwater: LibRaw_whitebalance_code = 65;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_FluorescentHigh: LibRaw_whitebalance_code = 66;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_HT_Mercury: LibRaw_whitebalance_code = 67;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_AsShot: LibRaw_whitebalance_code = 81;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Auto: LibRaw_whitebalance_code = 82;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom: LibRaw_whitebalance_code = 83;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Auto1: LibRaw_whitebalance_code = 85;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Auto2: LibRaw_whitebalance_code = 86;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Auto3: LibRaw_whitebalance_code = 87;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Auto4: LibRaw_whitebalance_code = 88;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom1: LibRaw_whitebalance_code = 90;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom2: LibRaw_whitebalance_code = 91;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom3: LibRaw_whitebalance_code = 92;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom4: LibRaw_whitebalance_code = 93;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom5: LibRaw_whitebalance_code = 94;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Custom6: LibRaw_whitebalance_code = 95;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_PC_Set1: LibRaw_whitebalance_code = 96;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_PC_Set2: LibRaw_whitebalance_code = 97;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_PC_Set3: LibRaw_whitebalance_code = 98;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_PC_Set4: LibRaw_whitebalance_code = 99;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_PC_Set5: LibRaw_whitebalance_code = 100;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Measured: LibRaw_whitebalance_code = 110;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_BW: LibRaw_whitebalance_code = 120;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Kelvin: LibRaw_whitebalance_code = 254;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_Other: LibRaw_whitebalance_code = 255;
pub const LibRaw_whitebalance_code_LIBRAW_WBI_None: LibRaw_whitebalance_code = 65535;
pub type LibRaw_whitebalance_code = libc::c_int;
pub const LibRaw_MultiExposure_related_LIBRAW_ME_NONE: LibRaw_MultiExposure_related = 0;
pub const LibRaw_MultiExposure_related_LIBRAW_ME_SIMPLE: LibRaw_MultiExposure_related = 1;
pub const LibRaw_MultiExposure_related_LIBRAW_ME_OVERLAY: LibRaw_MultiExposure_related = 2;
pub const LibRaw_MultiExposure_related_LIBRAW_ME_HDR: LibRaw_MultiExposure_related = 3;
pub type LibRaw_MultiExposure_related = libc::c_int;
pub const LibRaw_dng_processing_LIBRAW_DNG_NONE: LibRaw_dng_processing = 0;
pub const LibRaw_dng_processing_LIBRAW_DNG_FLOAT: LibRaw_dng_processing = 1;
pub const LibRaw_dng_processing_LIBRAW_DNG_LINEAR: LibRaw_dng_processing = 2;
pub const LibRaw_dng_processing_LIBRAW_DNG_DEFLATE: LibRaw_dng_processing = 4;
pub const LibRaw_dng_processing_LIBRAW_DNG_XTRANS: LibRaw_dng_processing = 8;
pub const LibRaw_dng_processing_LIBRAW_DNG_OTHER: LibRaw_dng_processing = 16;
pub const LibRaw_dng_processing_LIBRAW_DNG_8BIT: LibRaw_dng_processing = 32;
pub const LibRaw_dng_processing_LIBRAW_DNG_ALL: LibRaw_dng_processing = 63;
pub const LibRaw_dng_processing_LIBRAW_DNG_DEFAULT: LibRaw_dng_processing = 39;
pub type LibRaw_dng_processing = libc::c_int;
pub const LibRaw_output_flags_LIBRAW_OUTPUT_FLAGS_NONE: LibRaw_output_flags = 0;
pub const LibRaw_output_flags_LIBRAW_OUTPUT_FLAGS_PPMMETA: LibRaw_output_flags = 1;
pub type LibRaw_output_flags = libc::c_int;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_RAWSPEED: LibRaw_runtime_capabilities = 1;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_DNGSDK: LibRaw_runtime_capabilities = 2;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_GPRSDK: LibRaw_runtime_capabilities = 4;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_UNICODEPATHS: LibRaw_runtime_capabilities = 8;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_X3FTOOLS: LibRaw_runtime_capabilities = 16;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_RPI6BY9: LibRaw_runtime_capabilities = 32;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_ZLIB: LibRaw_runtime_capabilities = 64;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_JPEG: LibRaw_runtime_capabilities = 128;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_RAWSPEED3: LibRaw_runtime_capabilities = 256;
pub const LibRaw_runtime_capabilities_LIBRAW_CAPS_RAWSPEED_BITS: LibRaw_runtime_capabilities = 512;
pub type LibRaw_runtime_capabilities = libc::c_int;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_NotFound: LibRaw_colorspace = 0;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_sRGB: LibRaw_colorspace = 1;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_AdobeRGB: LibRaw_colorspace = 2;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_WideGamutRGB: LibRaw_colorspace = 3;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_ProPhotoRGB: LibRaw_colorspace = 4;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_ICC: LibRaw_colorspace = 5;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_Uncalibrated: LibRaw_colorspace = 6;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_CameraLinearUniWB: LibRaw_colorspace = 7;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_CameraLinear: LibRaw_colorspace = 8;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_CameraGammaUniWB: LibRaw_colorspace = 9;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_CameraGamma: LibRaw_colorspace = 10;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_MonochromeLinear: LibRaw_colorspace = 11;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_MonochromeGamma: LibRaw_colorspace = 12;
pub const LibRaw_colorspace_LIBRAW_COLORSPACE_Unknown: LibRaw_colorspace = 255;
pub type LibRaw_colorspace = libc::c_int;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Unknown: LibRaw_cameramaker_index = 0;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Agfa: LibRaw_cameramaker_index = 1;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Alcatel: LibRaw_cameramaker_index = 2;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Apple: LibRaw_cameramaker_index = 3;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Aptina: LibRaw_cameramaker_index = 4;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_AVT: LibRaw_cameramaker_index = 5;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Baumer: LibRaw_cameramaker_index = 6;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Broadcom: LibRaw_cameramaker_index = 7;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Canon: LibRaw_cameramaker_index = 8;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Casio: LibRaw_cameramaker_index = 9;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_CINE: LibRaw_cameramaker_index = 10;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Clauss: LibRaw_cameramaker_index = 11;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Contax: LibRaw_cameramaker_index = 12;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Creative: LibRaw_cameramaker_index = 13;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_DJI: LibRaw_cameramaker_index = 14;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_DXO: LibRaw_cameramaker_index = 15;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Epson: LibRaw_cameramaker_index = 16;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Foculus: LibRaw_cameramaker_index = 17;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Fujifilm: LibRaw_cameramaker_index = 18;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Generic: LibRaw_cameramaker_index = 19;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Gione: LibRaw_cameramaker_index = 20;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_GITUP: LibRaw_cameramaker_index = 21;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Google: LibRaw_cameramaker_index = 22;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_GoPro: LibRaw_cameramaker_index = 23;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Hasselblad: LibRaw_cameramaker_index = 24;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_HTC: LibRaw_cameramaker_index = 25;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_I_Mobile: LibRaw_cameramaker_index = 26;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Imacon: LibRaw_cameramaker_index = 27;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_JK_Imaging: LibRaw_cameramaker_index = 28;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Kodak: LibRaw_cameramaker_index = 29;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Konica: LibRaw_cameramaker_index = 30;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Leaf: LibRaw_cameramaker_index = 31;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Leica: LibRaw_cameramaker_index = 32;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Lenovo: LibRaw_cameramaker_index = 33;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_LG: LibRaw_cameramaker_index = 34;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Logitech: LibRaw_cameramaker_index = 35;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Mamiya: LibRaw_cameramaker_index = 36;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Matrix: LibRaw_cameramaker_index = 37;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Meizu: LibRaw_cameramaker_index = 38;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Micron: LibRaw_cameramaker_index = 39;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Minolta: LibRaw_cameramaker_index = 40;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Motorola: LibRaw_cameramaker_index = 41;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_NGM: LibRaw_cameramaker_index = 42;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Nikon: LibRaw_cameramaker_index = 43;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Nokia: LibRaw_cameramaker_index = 44;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Olympus: LibRaw_cameramaker_index = 45;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_OmniVison: LibRaw_cameramaker_index = 46;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Panasonic: LibRaw_cameramaker_index = 47;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Parrot: LibRaw_cameramaker_index = 48;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Pentax: LibRaw_cameramaker_index = 49;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_PhaseOne: LibRaw_cameramaker_index = 50;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_PhotoControl: LibRaw_cameramaker_index = 51;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Photron: LibRaw_cameramaker_index = 52;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Pixelink: LibRaw_cameramaker_index = 53;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Polaroid: LibRaw_cameramaker_index = 54;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_RED: LibRaw_cameramaker_index = 55;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Ricoh: LibRaw_cameramaker_index = 56;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Rollei: LibRaw_cameramaker_index = 57;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_RoverShot: LibRaw_cameramaker_index = 58;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Samsung: LibRaw_cameramaker_index = 59;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Sigma: LibRaw_cameramaker_index = 60;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Sinar: LibRaw_cameramaker_index = 61;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_SMaL: LibRaw_cameramaker_index = 62;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Sony: LibRaw_cameramaker_index = 63;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_ST_Micro: LibRaw_cameramaker_index = 64;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_THL: LibRaw_cameramaker_index = 65;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_VLUU: LibRaw_cameramaker_index = 66;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Xiaomi: LibRaw_cameramaker_index = 67;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_XIAOYI: LibRaw_cameramaker_index = 68;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_YI: LibRaw_cameramaker_index = 69;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Yuneec: LibRaw_cameramaker_index = 70;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_Zeiss: LibRaw_cameramaker_index = 71;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_OnePlus: LibRaw_cameramaker_index = 72;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_ISG: LibRaw_cameramaker_index = 73;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_VIVO: LibRaw_cameramaker_index = 74;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_HMD_Global: LibRaw_cameramaker_index = 75;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_HUAWEI: LibRaw_cameramaker_index = 76;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_RaspberryPi: LibRaw_cameramaker_index = 77;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_OmDigital: LibRaw_cameramaker_index = 78;
pub const LibRaw_cameramaker_index_LIBRAW_CAMERAMAKER_TheLastOne: LibRaw_cameramaker_index = 79;
pub type LibRaw_cameramaker_index = libc::c_int;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Unknown: LibRaw_camera_mounts = 0;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Alpa: LibRaw_camera_mounts = 1;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_C: LibRaw_camera_mounts = 2;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Canon_EF_M: LibRaw_camera_mounts = 3;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Canon_EF_S: LibRaw_camera_mounts = 4;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Canon_EF: LibRaw_camera_mounts = 5;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Canon_RF: LibRaw_camera_mounts = 6;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Contax_N: LibRaw_camera_mounts = 7;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Contax645: LibRaw_camera_mounts = 8;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_FT: LibRaw_camera_mounts = 9;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_mFT: LibRaw_camera_mounts = 10;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Fuji_GF: LibRaw_camera_mounts = 11;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Fuji_GX: LibRaw_camera_mounts = 12;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Fuji_X: LibRaw_camera_mounts = 13;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Hasselblad_H: LibRaw_camera_mounts = 14;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Hasselblad_V: LibRaw_camera_mounts = 15;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Hasselblad_XCD: LibRaw_camera_mounts = 16;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Leica_M: LibRaw_camera_mounts = 17;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Leica_R: LibRaw_camera_mounts = 18;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Leica_S: LibRaw_camera_mounts = 19;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Leica_SL: LibRaw_camera_mounts = 20;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Leica_TL: LibRaw_camera_mounts = 21;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_LPS_L: LibRaw_camera_mounts = 22;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Mamiya67: LibRaw_camera_mounts = 23;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Mamiya645: LibRaw_camera_mounts = 24;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Minolta_A: LibRaw_camera_mounts = 25;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Nikon_CX: LibRaw_camera_mounts = 26;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Nikon_F: LibRaw_camera_mounts = 27;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Nikon_Z: LibRaw_camera_mounts = 28;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_PhaseOne_iXM_MV: LibRaw_camera_mounts = 29;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_PhaseOne_iXM_RS: LibRaw_camera_mounts = 30;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_PhaseOne_iXM: LibRaw_camera_mounts = 31;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Pentax_645: LibRaw_camera_mounts = 32;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Pentax_K: LibRaw_camera_mounts = 33;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Pentax_Q: LibRaw_camera_mounts = 34;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_RicohModule: LibRaw_camera_mounts = 35;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Rollei_bayonet: LibRaw_camera_mounts = 36;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Samsung_NX_M: LibRaw_camera_mounts = 37;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Samsung_NX: LibRaw_camera_mounts = 38;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Sigma_X3F: LibRaw_camera_mounts = 39;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_Sony_E: LibRaw_camera_mounts = 40;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_LF: LibRaw_camera_mounts = 41;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_DigitalBack: LibRaw_camera_mounts = 42;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_FixedLens: LibRaw_camera_mounts = 43;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_IL_UM: LibRaw_camera_mounts = 44;
pub const LibRaw_camera_mounts_LIBRAW_MOUNT_TheLastOne: LibRaw_camera_mounts = 45;
pub type LibRaw_camera_mounts = libc::c_int;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_Unknown: LibRaw_camera_formats = 0;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_APSC: LibRaw_camera_formats = 1;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_FF: LibRaw_camera_formats = 2;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_MF: LibRaw_camera_formats = 3;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_APSH: LibRaw_camera_formats = 4;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_1INCH: LibRaw_camera_formats = 5;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_1div2p3INCH: LibRaw_camera_formats = 6;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_1div1p7INCH: LibRaw_camera_formats = 7;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_FT: LibRaw_camera_formats = 8;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_CROP645: LibRaw_camera_formats = 9;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_LeicaS: LibRaw_camera_formats = 10;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_645: LibRaw_camera_formats = 11;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_66: LibRaw_camera_formats = 12;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_69: LibRaw_camera_formats = 13;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_LF: LibRaw_camera_formats = 14;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_Leica_DMR: LibRaw_camera_formats = 15;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_67: LibRaw_camera_formats = 16;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_SigmaAPSC: LibRaw_camera_formats = 17;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_SigmaMerrill: LibRaw_camera_formats = 18;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_SigmaAPSH: LibRaw_camera_formats = 19;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_3648: LibRaw_camera_formats = 20;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_68: LibRaw_camera_formats = 21;
pub const LibRaw_camera_formats_LIBRAW_FORMAT_TheLastOne: LibRaw_camera_formats = 22;
pub type LibRaw_camera_formats = libc::c_int;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_UNKNOWN: LibRawImageAspects = 0;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_OTHER: LibRawImageAspects = 1;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_MINIMAL_REAL_ASPECT_VALUE: LibRawImageAspects = 99;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_MAXIMAL_REAL_ASPECT_VALUE: LibRawImageAspects =
    10000;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_3to2: LibRawImageAspects = 1500;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_1to1: LibRawImageAspects = 1000;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_4to3: LibRawImageAspects = 1333;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_16to9: LibRawImageAspects = 1777;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_5to4: LibRawImageAspects = 1250;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_7to6: LibRawImageAspects = 1166;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_6to5: LibRawImageAspects = 1200;
pub const LibRawImageAspects_LIBRAW_IMAGE_ASPECT_7to5: LibRawImageAspects = 1400;
pub type LibRawImageAspects = libc::c_int;
pub const LibRaw_lens_focal_types_LIBRAW_FT_UNDEFINED: LibRaw_lens_focal_types = 0;
pub const LibRaw_lens_focal_types_LIBRAW_FT_PRIME_LENS: LibRaw_lens_focal_types = 1;
pub const LibRaw_lens_focal_types_LIBRAW_FT_ZOOM_LENS: LibRaw_lens_focal_types = 2;
pub const LibRaw_lens_focal_types_LIBRAW_FT_ZOOM_LENS_CONSTANT_APERTURE: LibRaw_lens_focal_types =
    3;
pub const LibRaw_lens_focal_types_LIBRAW_FT_ZOOM_LENS_VARIABLE_APERTURE: LibRaw_lens_focal_types =
    4;
pub type LibRaw_lens_focal_types = libc::c_int;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_UNDEFINED: LibRaw_Canon_RecordModes = 0;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_JPEG: LibRaw_Canon_RecordModes = 1;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CRW_THM: LibRaw_Canon_RecordModes = 2;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_AVI_THM: LibRaw_Canon_RecordModes = 3;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_TIF: LibRaw_Canon_RecordModes = 4;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_TIF_JPEG: LibRaw_Canon_RecordModes = 5;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CR2: LibRaw_Canon_RecordModes = 6;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CR2_JPEG: LibRaw_Canon_RecordModes = 7;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_UNKNOWN: LibRaw_Canon_RecordModes = 8;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_MOV: LibRaw_Canon_RecordModes = 9;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_MP4: LibRaw_Canon_RecordModes = 10;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CRM: LibRaw_Canon_RecordModes = 11;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CR3: LibRaw_Canon_RecordModes = 12;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CR3_JPEG: LibRaw_Canon_RecordModes = 13;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_HEIF: LibRaw_Canon_RecordModes = 14;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_CR3_HEIF: LibRaw_Canon_RecordModes = 15;
pub const LibRaw_Canon_RecordModes_LIBRAW_Canon_RecordMode_TheLastOne: LibRaw_Canon_RecordModes =
    16;
pub type LibRaw_Canon_RecordModes = libc::c_int;
pub const LibRaw_minolta_storagemethods_LIBRAW_MINOLTA_UNPACKED: LibRaw_minolta_storagemethods = 82;
pub const LibRaw_minolta_storagemethods_LIBRAW_MINOLTA_PACKED: LibRaw_minolta_storagemethods = 89;
pub type LibRaw_minolta_storagemethods = libc::c_int;
pub const LibRaw_minolta_bayerpatterns_LIBRAW_MINOLTA_RGGB: LibRaw_minolta_bayerpatterns = 1;
pub const LibRaw_minolta_bayerpatterns_LIBRAW_MINOLTA_G2BRG1: LibRaw_minolta_bayerpatterns = 4;
pub type LibRaw_minolta_bayerpatterns = libc::c_int;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_DSC: LibRaw_sony_cameratypes = 1;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_DSLR: LibRaw_sony_cameratypes = 2;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_NEX: LibRaw_sony_cameratypes = 3;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_SLT: LibRaw_sony_cameratypes = 4;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_ILCE: LibRaw_sony_cameratypes = 5;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_ILCA: LibRaw_sony_cameratypes = 6;
pub const LibRaw_sony_cameratypes_LIBRAW_SONY_CameraType_UNKNOWN: LibRaw_sony_cameratypes = 65535;
pub type LibRaw_sony_cameratypes = libc::c_int;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010None: LibRaw_Sony_0x2010_Type = 0;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010a: LibRaw_Sony_0x2010_Type = 1;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010b: LibRaw_Sony_0x2010_Type = 2;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010c: LibRaw_Sony_0x2010_Type = 3;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010d: LibRaw_Sony_0x2010_Type = 4;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010e: LibRaw_Sony_0x2010_Type = 5;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010f: LibRaw_Sony_0x2010_Type = 6;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010g: LibRaw_Sony_0x2010_Type = 7;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010h: LibRaw_Sony_0x2010_Type = 8;
pub const LibRaw_Sony_0x2010_Type_LIBRAW_SONY_Tag2010i: LibRaw_Sony_0x2010_Type = 9;
pub type LibRaw_Sony_0x2010_Type = libc::c_int;
pub const LibRaw_Sony_0x9050_Type_LIBRAW_SONY_Tag9050None: LibRaw_Sony_0x9050_Type = 0;
pub const LibRaw_Sony_0x9050_Type_LIBRAW_SONY_Tag9050a: LibRaw_Sony_0x9050_Type = 1;
pub const LibRaw_Sony_0x9050_Type_LIBRAW_SONY_Tag9050b: LibRaw_Sony_0x9050_Type = 2;
pub const LibRaw_Sony_0x9050_Type_LIBRAW_SONY_Tag9050c: LibRaw_Sony_0x9050_Type = 3;
pub type LibRaw_Sony_0x9050_Type = libc::c_int;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_MF: LIBRAW_SONY_FOCUSMODEmodes = 0;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_AF_S: LIBRAW_SONY_FOCUSMODEmodes = 2;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_AF_C: LIBRAW_SONY_FOCUSMODEmodes = 3;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_AF_A: LIBRAW_SONY_FOCUSMODEmodes = 4;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_DMF: LIBRAW_SONY_FOCUSMODEmodes = 6;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_AF_D: LIBRAW_SONY_FOCUSMODEmodes = 7;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_AF: LIBRAW_SONY_FOCUSMODEmodes = 101;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_PERMANENT_AF:
    LIBRAW_SONY_FOCUSMODEmodes = 104;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_SEMI_MF: LIBRAW_SONY_FOCUSMODEmodes =
    105;
pub const LIBRAW_SONY_FOCUSMODEmodes_LIBRAW_SONY_FOCUSMODE_UNKNOWN: LIBRAW_SONY_FOCUSMODEmodes = -1;
pub type LIBRAW_SONY_FOCUSMODEmodes = libc::c_int;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_UnknownSensor: LibRaw_KodakSensors = 0;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M1: LibRaw_KodakSensors = 1;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M15: LibRaw_KodakSensors = 2;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M16: LibRaw_KodakSensors = 3;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M17: LibRaw_KodakSensors = 4;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M2: LibRaw_KodakSensors = 5;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M23: LibRaw_KodakSensors = 6;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M24: LibRaw_KodakSensors = 7;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M3: LibRaw_KodakSensors = 8;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M5: LibRaw_KodakSensors = 9;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M6: LibRaw_KodakSensors = 10;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_C14: LibRaw_KodakSensors = 11;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_X14: LibRaw_KodakSensors = 12;
pub const LibRaw_KodakSensors_LIBRAW_Kodak_M11: LibRaw_KodakSensors = 13;
pub type LibRaw_KodakSensors = libc::c_int;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_Unknown: LibRaw_HasselbladFormatCodes = 0;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_3FR: LibRaw_HasselbladFormatCodes = 1;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_FFF: LibRaw_HasselbladFormatCodes = 2;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_Imacon: LibRaw_HasselbladFormatCodes = 3;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_HasselbladDNG: LibRaw_HasselbladFormatCodes = 4;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_AdobeDNG: LibRaw_HasselbladFormatCodes = 5;
pub const LibRaw_HasselbladFormatCodes_LIBRAW_HF_AdobeDNG_fromPhocusDNG:
    LibRaw_HasselbladFormatCodes = 6;
pub type LibRaw_HasselbladFormatCodes = libc::c_int;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_NONE: LibRaw_rawspecial_t = 0;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_BASEONLY: LibRaw_rawspecial_t = 1;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_DELTAONLY: LibRaw_rawspecial_t = 2;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_DELTAZEROBASE: LibRaw_rawspecial_t = 4;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_DELTATOVALUE: LibRaw_rawspecial_t = 8;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SONYARW2_ALLFLAGS: LibRaw_rawspecial_t = 15;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_NODP2Q_INTERPOLATERG: LibRaw_rawspecial_t = 16;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_NODP2Q_INTERPOLATEAF: LibRaw_rawspecial_t = 32;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SRAW_NO_RGB: LibRaw_rawspecial_t = 64;
pub const LibRaw_rawspecial_t_LIBRAW_RAWSPECIAL_SRAW_NO_INTERPOLATE: LibRaw_rawspecial_t = 128;
pub type LibRaw_rawspecial_t = libc::c_int;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV1_USE: LibRaw_rawspeed_bits_t = 1;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV1_FAILONUNKNOWN: LibRaw_rawspeed_bits_t = 2;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV1_IGNOREERRORS: LibRaw_rawspeed_bits_t = 4;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV3_USE: LibRaw_rawspeed_bits_t = 256;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV3_FAILONUNKNOWN: LibRaw_rawspeed_bits_t = 512;
pub const LibRaw_rawspeed_bits_t_LIBRAW_RAWSPEEDV3_IGNOREERRORS: LibRaw_rawspeed_bits_t = 1024;
pub type LibRaw_rawspeed_bits_t = libc::c_int;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_PENTAX_PS_ALLFRAMES:
    LibRaw_processing_options = 1;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_CONVERTFLOAT_TO_INT:
    LibRaw_processing_options = 2;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_ARQ_SKIP_CHANNEL_SWAP:
    LibRaw_processing_options = 4;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_NO_ROTATE_FOR_KODAK_THUMBNAILS:
    LibRaw_processing_options = 8;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_USE_PPM16_THUMBS: LibRaw_processing_options =
    32;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DONT_CHECK_DNG_ILLUMINANT:
    LibRaw_processing_options = 64;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNGSDK_ZEROCOPY: LibRaw_processing_options =
    128;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_ZEROFILTERS_FOR_MONOCHROMETIFFS:
    LibRaw_processing_options = 256;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_ADD_ENHANCED: LibRaw_processing_options =
    512;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_ADD_PREVIEWS: LibRaw_processing_options =
    1024;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_PREFER_LARGEST_IMAGE:
    LibRaw_processing_options = 2048;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_STAGE2: LibRaw_processing_options = 4096;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_STAGE3: LibRaw_processing_options = 8192;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_ALLOWSIZECHANGE:
    LibRaw_processing_options = 16384;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_DISABLEWBADJUST:
    LibRaw_processing_options = 32768;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_PROVIDE_NONSTANDARD_WB:
    LibRaw_processing_options = 65536;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_CAMERAWB_FALLBACK_TO_DAYLIGHT:
    LibRaw_processing_options = 131072;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_CHECK_THUMBNAILS_KNOWN_VENDORS:
    LibRaw_processing_options = 262144;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_CHECK_THUMBNAILS_ALL_VENDORS:
    LibRaw_processing_options = 524288;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_STAGE2_IFPRESENT:
    LibRaw_processing_options = 1048576;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_STAGE3_IFPRESENT:
    LibRaw_processing_options = 2097152;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_DNG_ADD_MASKS: LibRaw_processing_options =
    4194304;
pub const LibRaw_processing_options_LIBRAW_RAWOPTIONS_CANON_IGNORE_MAKERNOTES_ROTATION:
    LibRaw_processing_options = 8388608;
pub type LibRaw_processing_options = libc::c_int;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_HASCURVE: LibRaw_decoder_flags = 16;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_SONYARW2: LibRaw_decoder_flags = 32;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_TRYRAWSPEED: LibRaw_decoder_flags = 64;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_OWNALLOC: LibRaw_decoder_flags = 128;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_FIXEDMAXC: LibRaw_decoder_flags = 256;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_ADOBECOPYPIXEL: LibRaw_decoder_flags = 512;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_LEGACY_WITH_MARGINS: LibRaw_decoder_flags = 1024;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_3CHANNEL: LibRaw_decoder_flags = 2048;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_SINAR4SHOT: LibRaw_decoder_flags = 2048;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_FLATDATA: LibRaw_decoder_flags = 4096;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_FLAT_BG2_SWAPPED: LibRaw_decoder_flags = 8192;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_UNSUPPORTED_FORMAT: LibRaw_decoder_flags = 16384;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_NOTSET: LibRaw_decoder_flags = 32768;
pub const LibRaw_decoder_flags_LIBRAW_DECODER_TRYRAWSPEED3: LibRaw_decoder_flags = 65536;
pub type LibRaw_decoder_flags = libc::c_int;
pub const LibRaw_constructor_flags_LIBRAW_OPTIONS_NONE: LibRaw_constructor_flags = 0;
pub const LibRaw_constructor_flags_LIBRAW_OPTIONS_NO_DATAERR_CALLBACK: LibRaw_constructor_flags = 2;
pub const LibRaw_constructor_flags_LIBRAW_OPIONS_NO_DATAERR_CALLBACK: LibRaw_constructor_flags = 2;
pub type LibRaw_constructor_flags = libc::c_int;
pub const LibRaw_warnings_LIBRAW_WARN_NONE: LibRaw_warnings = 0;
pub const LibRaw_warnings_LIBRAW_WARN_BAD_CAMERA_WB: LibRaw_warnings = 4;
pub const LibRaw_warnings_LIBRAW_WARN_NO_METADATA: LibRaw_warnings = 8;
pub const LibRaw_warnings_LIBRAW_WARN_NO_JPEGLIB: LibRaw_warnings = 16;
pub const LibRaw_warnings_LIBRAW_WARN_NO_EMBEDDED_PROFILE: LibRaw_warnings = 32;
pub const LibRaw_warnings_LIBRAW_WARN_NO_INPUT_PROFILE: LibRaw_warnings = 64;
pub const LibRaw_warnings_LIBRAW_WARN_BAD_OUTPUT_PROFILE: LibRaw_warnings = 128;
pub const LibRaw_warnings_LIBRAW_WARN_NO_BADPIXELMAP: LibRaw_warnings = 256;
pub const LibRaw_warnings_LIBRAW_WARN_BAD_DARKFRAME_FILE: LibRaw_warnings = 512;
pub const LibRaw_warnings_LIBRAW_WARN_BAD_DARKFRAME_DIM: LibRaw_warnings = 1024;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED_PROBLEM: LibRaw_warnings = 4096;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED_UNSUPPORTED: LibRaw_warnings = 8192;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED_PROCESSED: LibRaw_warnings = 16384;
pub const LibRaw_warnings_LIBRAW_WARN_FALLBACK_TO_AHD: LibRaw_warnings = 32768;
pub const LibRaw_warnings_LIBRAW_WARN_PARSEFUJI_PROCESSED: LibRaw_warnings = 65536;
pub const LibRaw_warnings_LIBRAW_WARN_DNGSDK_PROCESSED: LibRaw_warnings = 131072;
pub const LibRaw_warnings_LIBRAW_WARN_DNG_IMAGES_REORDERED: LibRaw_warnings = 262144;
pub const LibRaw_warnings_LIBRAW_WARN_DNG_STAGE2_APPLIED: LibRaw_warnings = 524288;
pub const LibRaw_warnings_LIBRAW_WARN_DNG_STAGE3_APPLIED: LibRaw_warnings = 1048576;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED3_PROBLEM: LibRaw_warnings = 2097152;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED3_UNSUPPORTED: LibRaw_warnings = 4194304;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED3_PROCESSED: LibRaw_warnings = 8388608;
pub const LibRaw_warnings_LIBRAW_WARN_RAWSPEED3_NOTLISTED: LibRaw_warnings = 16777216;
pub type LibRaw_warnings = libc::c_int;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_NONE: LibRaw_exceptions = 0;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_ALLOC: LibRaw_exceptions = 1;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_DECODE_RAW: LibRaw_exceptions = 2;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_DECODE_JPEG: LibRaw_exceptions = 3;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_IO_EOF: LibRaw_exceptions = 4;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_IO_CORRUPT: LibRaw_exceptions = 5;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_CANCELLED_BY_CALLBACK: LibRaw_exceptions = 6;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_BAD_CROP: LibRaw_exceptions = 7;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_IO_BADFILE: LibRaw_exceptions = 8;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_DECODE_JPEG2000: LibRaw_exceptions = 9;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_TOOBIG: LibRaw_exceptions = 10;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_MEMPOOL: LibRaw_exceptions = 11;
pub const LibRaw_exceptions_LIBRAW_EXCEPTION_UNSUPPORTED_FORMAT: LibRaw_exceptions = 12;
pub type LibRaw_exceptions = libc::c_int;
pub const LibRaw_progress_LIBRAW_PROGRESS_START: LibRaw_progress = 0;
pub const LibRaw_progress_LIBRAW_PROGRESS_OPEN: LibRaw_progress = 1;
pub const LibRaw_progress_LIBRAW_PROGRESS_IDENTIFY: LibRaw_progress = 2;
pub const LibRaw_progress_LIBRAW_PROGRESS_SIZE_ADJUST: LibRaw_progress = 4;
pub const LibRaw_progress_LIBRAW_PROGRESS_LOAD_RAW: LibRaw_progress = 8;
pub const LibRaw_progress_LIBRAW_PROGRESS_RAW2_IMAGE: LibRaw_progress = 16;
pub const LibRaw_progress_LIBRAW_PROGRESS_REMOVE_ZEROES: LibRaw_progress = 32;
pub const LibRaw_progress_LIBRAW_PROGRESS_BAD_PIXELS: LibRaw_progress = 64;
pub const LibRaw_progress_LIBRAW_PROGRESS_DARK_FRAME: LibRaw_progress = 128;
pub const LibRaw_progress_LIBRAW_PROGRESS_FOVEON_INTERPOLATE: LibRaw_progress = 256;
pub const LibRaw_progress_LIBRAW_PROGRESS_SCALE_COLORS: LibRaw_progress = 512;
pub const LibRaw_progress_LIBRAW_PROGRESS_PRE_INTERPOLATE: LibRaw_progress = 1024;
pub const LibRaw_progress_LIBRAW_PROGRESS_INTERPOLATE: LibRaw_progress = 2048;
pub const LibRaw_progress_LIBRAW_PROGRESS_MIX_GREEN: LibRaw_progress = 4096;
pub const LibRaw_progress_LIBRAW_PROGRESS_MEDIAN_FILTER: LibRaw_progress = 8192;
pub const LibRaw_progress_LIBRAW_PROGRESS_HIGHLIGHTS: LibRaw_progress = 16384;
pub const LibRaw_progress_LIBRAW_PROGRESS_FUJI_ROTATE: LibRaw_progress = 32768;
pub const LibRaw_progress_LIBRAW_PROGRESS_FLIP: LibRaw_progress = 65536;
pub const LibRaw_progress_LIBRAW_PROGRESS_APPLY_PROFILE: LibRaw_progress = 131072;
pub const LibRaw_progress_LIBRAW_PROGRESS_CONVERT_RGB: LibRaw_progress = 262144;
pub const LibRaw_progress_LIBRAW_PROGRESS_STRETCH: LibRaw_progress = 524288;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE20: LibRaw_progress = 1048576;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE21: LibRaw_progress = 2097152;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE22: LibRaw_progress = 4194304;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE23: LibRaw_progress = 8388608;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE24: LibRaw_progress = 16777216;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE25: LibRaw_progress = 33554432;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE26: LibRaw_progress = 67108864;
pub const LibRaw_progress_LIBRAW_PROGRESS_STAGE27: LibRaw_progress = 134217728;
pub const LibRaw_progress_LIBRAW_PROGRESS_THUMB_LOAD: LibRaw_progress = 268435456;
pub const LibRaw_progress_LIBRAW_PROGRESS_TRESERVED1: LibRaw_progress = 536870912;
pub const LibRaw_progress_LIBRAW_PROGRESS_TRESERVED2: LibRaw_progress = 1073741824;
pub type LibRaw_progress = libc::c_int;
pub const LibRaw_errors_LIBRAW_SUCCESS: LibRaw_errors = 0;
pub const LibRaw_errors_LIBRAW_UNSPECIFIED_ERROR: LibRaw_errors = -1;
pub const LibRaw_errors_LIBRAW_FILE_UNSUPPORTED: LibRaw_errors = -2;
pub const LibRaw_errors_LIBRAW_REQUEST_FOR_NONEXISTENT_IMAGE: LibRaw_errors = -3;
pub const LibRaw_errors_LIBRAW_OUT_OF_ORDER_CALL: LibRaw_errors = -4;
pub const LibRaw_errors_LIBRAW_NO_THUMBNAIL: LibRaw_errors = -5;
pub const LibRaw_errors_LIBRAW_UNSUPPORTED_THUMBNAIL: LibRaw_errors = -6;
pub const LibRaw_errors_LIBRAW_INPUT_CLOSED: LibRaw_errors = -7;
pub const LibRaw_errors_LIBRAW_NOT_IMPLEMENTED: LibRaw_errors = -8;
pub const LibRaw_errors_LIBRAW_REQUEST_FOR_NONEXISTENT_THUMBNAIL: LibRaw_errors = -9;
pub const LibRaw_errors_LIBRAW_UNSUFFICIENT_MEMORY: LibRaw_errors = -100007;
pub const LibRaw_errors_LIBRAW_DATA_ERROR: LibRaw_errors = -100008;
pub const LibRaw_errors_LIBRAW_IO_ERROR: LibRaw_errors = -100009;
pub const LibRaw_errors_LIBRAW_CANCELLED_BY_CALLBACK: LibRaw_errors = -100010;
pub const LibRaw_errors_LIBRAW_BAD_CROP: LibRaw_errors = -100011;
pub const LibRaw_errors_LIBRAW_TOO_BIG: LibRaw_errors = -100012;
pub const LibRaw_errors_LIBRAW_MEMPOOL_OVERFLOW: LibRaw_errors = -100013;
pub type LibRaw_errors = libc::c_int;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_UNKNOWN:
    LibRaw_internal_thumbnail_formats = 0;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_KODAK_THUMB:
    LibRaw_internal_thumbnail_formats = 1;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_KODAK_YCBCR:
    LibRaw_internal_thumbnail_formats = 2;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_KODAK_RGB:
    LibRaw_internal_thumbnail_formats = 3;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_JPEG:
    LibRaw_internal_thumbnail_formats = 4;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_LAYER:
    LibRaw_internal_thumbnail_formats = 5;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_ROLLEI:
    LibRaw_internal_thumbnail_formats = 6;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_PPM:
    LibRaw_internal_thumbnail_formats = 7;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_PPM16:
    LibRaw_internal_thumbnail_formats = 8;
pub const LibRaw_internal_thumbnail_formats_LIBRAW_INTERNAL_THUMBNAIL_X3F:
    LibRaw_internal_thumbnail_formats = 9;
pub type LibRaw_internal_thumbnail_formats = libc::c_int;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_UNKNOWN: LibRaw_thumbnail_formats = 0;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_JPEG: LibRaw_thumbnail_formats = 1;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_BITMAP: LibRaw_thumbnail_formats = 2;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_BITMAP16: LibRaw_thumbnail_formats = 3;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_LAYER: LibRaw_thumbnail_formats = 4;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_ROLLEI: LibRaw_thumbnail_formats = 5;
pub const LibRaw_thumbnail_formats_LIBRAW_THUMBNAIL_H265: LibRaw_thumbnail_formats = 6;
pub type LibRaw_thumbnail_formats = libc::c_int;
pub const LibRaw_image_formats_LIBRAW_IMAGE_JPEG: LibRaw_image_formats = 1;
pub const LibRaw_image_formats_LIBRAW_IMAGE_BITMAP: LibRaw_image_formats = 2;
pub type LibRaw_image_formats = libc::c_int;
pub type INT64 = libc::c_longlong;
pub type UINT64 = libc::c_ulonglong;
pub type uchar = libc::c_uchar;
pub type ushort = libc::c_ushort;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_decoder_info_t {
    pub decoder_name: *const libc::c_char,
    pub decoder_flags: libc::c_uint,
}
#[test]
fn bindgen_test_layout_libraw_decoder_info_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_decoder_info_t>(),
        16usize,
        concat!("Size of: ", stringify!(libraw_decoder_info_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_decoder_info_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_decoder_info_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_decoder_info_t>())).decoder_name as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_decoder_info_t),
            "::",
            stringify!(decoder_name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_decoder_info_t>())).decoder_flags as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_decoder_info_t),
            "::",
            stringify!(decoder_flags)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_internal_output_params_t {
    pub mix_green: libc::c_uint,
    pub raw_color: libc::c_uint,
    pub zero_is_bad: libc::c_uint,
    pub shrink: ushort,
    pub fuji_width: ushort,
}
#[test]
fn bindgen_test_layout_libraw_internal_output_params_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_internal_output_params_t>(),
        16usize,
        concat!("Size of: ", stringify!(libraw_internal_output_params_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_internal_output_params_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_internal_output_params_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_internal_output_params_t>())).mix_green as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_internal_output_params_t),
            "::",
            stringify!(mix_green)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_internal_output_params_t>())).raw_color as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_internal_output_params_t),
            "::",
            stringify!(raw_color)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_internal_output_params_t>())).zero_is_bad as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_internal_output_params_t),
            "::",
            stringify!(zero_is_bad)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_internal_output_params_t>())).shrink as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_internal_output_params_t),
            "::",
            stringify!(shrink)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_internal_output_params_t>())).fuji_width as *const _
                as usize
        },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_internal_output_params_t),
            "::",
            stringify!(fuji_width)
        )
    );
}
pub type memory_callback = ::core::option::Option<
    unsafe extern "C" fn(
        data: *mut libc::c_void,
        file: *const libc::c_char,
        where_: *const libc::c_char,
    ),
>;
pub type exif_parser_callback = ::core::option::Option<
    unsafe extern "C" fn(
        context: *mut libc::c_void,
        tag: libc::c_int,
        type_: libc::c_int,
        len: libc::c_int,
        ord: libc::c_uint,
        ifp: *mut libc::c_void,
        base: INT64,
    ),
>;
pub type data_callback = ::core::option::Option<
    unsafe extern "C" fn(data: *mut libc::c_void, file: *const libc::c_char, offset: libc::c_int),
>;
extern "C" {
    pub fn default_data_callback(
        data: *mut libc::c_void,
        file: *const libc::c_char,
        offset: libc::c_int,
    );
}
pub type progress_callback = ::core::option::Option<
    unsafe extern "C" fn(
        data: *mut libc::c_void,
        stage: LibRaw_progress,
        iteration: libc::c_int,
        expected: libc::c_int,
    ) -> libc::c_int,
>;
pub type pre_identify_callback =
    ::core::option::Option<unsafe extern "C" fn(ctx: *mut libc::c_void) -> libc::c_int>;
pub type post_identify_callback =
    ::core::option::Option<unsafe extern "C" fn(ctx: *mut libc::c_void)>;
pub type process_step_callback =
    ::core::option::Option<unsafe extern "C" fn(ctx: *mut libc::c_void)>;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_callbacks_t {
    pub data_cb: data_callback,
    pub datacb_data: *mut libc::c_void,
    pub progress_cb: progress_callback,
    pub progresscb_data: *mut libc::c_void,
    pub exif_cb: exif_parser_callback,
    pub exifparser_data: *mut libc::c_void,
    pub pre_identify_cb: pre_identify_callback,
    pub post_identify_cb: post_identify_callback,
    pub pre_subtractblack_cb: process_step_callback,
    pub pre_scalecolors_cb: process_step_callback,
    pub pre_preinterpolate_cb: process_step_callback,
    pub pre_interpolate_cb: process_step_callback,
    pub interpolate_bayer_cb: process_step_callback,
    pub interpolate_xtrans_cb: process_step_callback,
    pub post_interpolate_cb: process_step_callback,
    pub pre_converttorgb_cb: process_step_callback,
    pub post_converttorgb_cb: process_step_callback,
}
#[test]
fn bindgen_test_layout_libraw_callbacks_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_callbacks_t>(),
        136usize,
        concat!("Size of: ", stringify!(libraw_callbacks_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_callbacks_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_callbacks_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_callbacks_t>())).data_cb as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(data_cb)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_callbacks_t>())).datacb_data as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(datacb_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_callbacks_t>())).progress_cb as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(progress_cb)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_callbacks_t>())).progresscb_data as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(progresscb_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_callbacks_t>())).exif_cb as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(exif_cb)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_callbacks_t>())).exifparser_data as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(exifparser_data)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_callbacks_t>())).pre_identify_cb as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(pre_identify_cb)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_callbacks_t>())).post_identify_cb as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(post_identify_cb)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_callbacks_t>())).pre_subtractblack_cb as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(pre_subtractblack_cb)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_callbacks_t>())).pre_scalecolors_cb as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(pre_scalecolors_cb)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_callbacks_t>())).pre_preinterpolate_cb as *const _
                as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(pre_preinterpolate_cb)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_callbacks_t>())).pre_interpolate_cb as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(pre_interpolate_cb)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_callbacks_t>())).interpolate_bayer_cb as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(interpolate_bayer_cb)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_callbacks_t>())).interpolate_xtrans_cb as *const _
                as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(interpolate_xtrans_cb)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_callbacks_t>())).post_interpolate_cb as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(post_interpolate_cb)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_callbacks_t>())).pre_converttorgb_cb as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(pre_converttorgb_cb)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_callbacks_t>())).post_converttorgb_cb as *const _
                as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_callbacks_t),
            "::",
            stringify!(post_converttorgb_cb)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_processed_image_t {
    pub type_: LibRaw_image_formats,
    pub height: ushort,
    pub width: ushort,
    pub colors: ushort,
    pub bits: ushort,
    pub data_size: libc::c_uint,
    pub data: [libc::c_uchar; 1usize],
}
#[test]
fn bindgen_test_layout_libraw_processed_image_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_processed_image_t>(),
        20usize,
        concat!("Size of: ", stringify!(libraw_processed_image_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_processed_image_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_processed_image_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_processed_image_t>())).type_ as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_processed_image_t),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_processed_image_t>())).height as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_processed_image_t),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_processed_image_t>())).width as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_processed_image_t),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_processed_image_t>())).colors as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_processed_image_t),
            "::",
            stringify!(colors)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_processed_image_t>())).bits as *const _ as usize },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_processed_image_t),
            "::",
            stringify!(bits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_processed_image_t>())).data_size as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_processed_image_t),
            "::",
            stringify!(data_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_processed_image_t>())).data as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_processed_image_t),
            "::",
            stringify!(data)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_iparams_t {
    pub guard: [libc::c_char; 4usize],
    pub make: [libc::c_char; 64usize],
    pub model: [libc::c_char; 64usize],
    pub software: [libc::c_char; 64usize],
    pub normalized_make: [libc::c_char; 64usize],
    pub normalized_model: [libc::c_char; 64usize],
    pub maker_index: libc::c_uint,
    pub raw_count: libc::c_uint,
    pub dng_version: libc::c_uint,
    pub is_foveon: libc::c_uint,
    pub colors: libc::c_int,
    pub filters: libc::c_uint,
    pub xtrans: [[libc::c_char; 6usize]; 6usize],
    pub xtrans_abs: [[libc::c_char; 6usize]; 6usize],
    pub cdesc: [libc::c_char; 5usize],
    pub xmplen: libc::c_uint,
    pub xmpdata: *mut libc::c_char,
}
#[test]
fn bindgen_test_layout_libraw_iparams_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_iparams_t>(),
        440usize,
        concat!("Size of: ", stringify!(libraw_iparams_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_iparams_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_iparams_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_iparams_t>())).guard as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(guard)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_iparams_t>())).make as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(make)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_iparams_t>())).model as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(model)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_iparams_t>())).software as *const _ as usize },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(software)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_iparams_t>())).normalized_make as *const _ as usize
        },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(normalized_make)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_iparams_t>())).normalized_model as *const _ as usize
        },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(normalized_model)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_iparams_t>())).maker_index as *const _ as usize },
        324usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(maker_index)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_iparams_t>())).raw_count as *const _ as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(raw_count)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_iparams_t>())).dng_version as *const _ as usize },
        332usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(dng_version)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_iparams_t>())).is_foveon as *const _ as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(is_foveon)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_iparams_t>())).colors as *const _ as usize },
        340usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(colors)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_iparams_t>())).filters as *const _ as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(filters)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_iparams_t>())).xtrans as *const _ as usize },
        348usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(xtrans)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_iparams_t>())).xtrans_abs as *const _ as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(xtrans_abs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_iparams_t>())).cdesc as *const _ as usize },
        420usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(cdesc)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_iparams_t>())).xmplen as *const _ as usize },
        428usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(xmplen)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_iparams_t>())).xmpdata as *const _ as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_iparams_t),
            "::",
            stringify!(xmpdata)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_raw_inset_crop_t {
    pub cleft: ushort,
    pub ctop: ushort,
    pub cwidth: ushort,
    pub cheight: ushort,
}
#[test]
fn bindgen_test_layout_libraw_raw_inset_crop_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_raw_inset_crop_t>(),
        8usize,
        concat!("Size of: ", stringify!(libraw_raw_inset_crop_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_raw_inset_crop_t>(),
        2usize,
        concat!("Alignment of ", stringify!(libraw_raw_inset_crop_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_raw_inset_crop_t>())).cleft as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_raw_inset_crop_t),
            "::",
            stringify!(cleft)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_raw_inset_crop_t>())).ctop as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_raw_inset_crop_t),
            "::",
            stringify!(ctop)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_raw_inset_crop_t>())).cwidth as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_raw_inset_crop_t),
            "::",
            stringify!(cwidth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_raw_inset_crop_t>())).cheight as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_raw_inset_crop_t),
            "::",
            stringify!(cheight)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_image_sizes_t {
    pub raw_height: ushort,
    pub raw_width: ushort,
    pub height: ushort,
    pub width: ushort,
    pub top_margin: ushort,
    pub left_margin: ushort,
    pub iheight: ushort,
    pub iwidth: ushort,
    pub raw_pitch: libc::c_uint,
    pub pixel_aspect: f64,
    pub flip: libc::c_int,
    pub mask: [[libc::c_int; 4usize]; 8usize],
    pub raw_aspect: ushort,
    pub raw_inset_crops: [libraw_raw_inset_crop_t; 2usize],
}
#[test]
fn bindgen_test_layout_libraw_image_sizes_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_image_sizes_t>(),
        184usize,
        concat!("Size of: ", stringify!(libraw_image_sizes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_image_sizes_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_image_sizes_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_image_sizes_t>())).raw_height as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(raw_height)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_image_sizes_t>())).raw_width as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(raw_width)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_image_sizes_t>())).height as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_image_sizes_t>())).width as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(width)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_image_sizes_t>())).top_margin as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(top_margin)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_image_sizes_t>())).left_margin as *const _ as usize
        },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(left_margin)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_image_sizes_t>())).iheight as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(iheight)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_image_sizes_t>())).iwidth as *const _ as usize },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(iwidth)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_image_sizes_t>())).raw_pitch as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(raw_pitch)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_image_sizes_t>())).pixel_aspect as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(pixel_aspect)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_image_sizes_t>())).flip as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(flip)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_image_sizes_t>())).mask as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(mask)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_image_sizes_t>())).raw_aspect as *const _ as usize
        },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(raw_aspect)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_image_sizes_t>())).raw_inset_crops as *const _ as usize
        },
        166usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_image_sizes_t),
            "::",
            stringify!(raw_inset_crops)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_area_t {
    pub t: libc::c_short,
    pub l: libc::c_short,
    pub b: libc::c_short,
    pub r: libc::c_short,
}
#[test]
fn bindgen_test_layout_libraw_area_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_area_t>(),
        8usize,
        concat!("Size of: ", stringify!(libraw_area_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_area_t>(),
        2usize,
        concat!("Alignment of ", stringify!(libraw_area_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_area_t>())).t as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_area_t),
            "::",
            stringify!(t)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_area_t>())).l as *const _ as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_area_t),
            "::",
            stringify!(l)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_area_t>())).b as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_area_t),
            "::",
            stringify!(b)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_area_t>())).r as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_area_t),
            "::",
            stringify!(r)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct ph1_t {
    pub format: libc::c_int,
    pub key_off: libc::c_int,
    pub tag_21a: libc::c_int,
    pub t_black: libc::c_int,
    pub split_col: libc::c_int,
    pub black_col: libc::c_int,
    pub split_row: libc::c_int,
    pub black_row: libc::c_int,
    pub tag_210: f32,
}
#[test]
fn bindgen_test_layout_ph1_t() {
    assert_eq!(
        ::core::mem::size_of::<ph1_t>(),
        36usize,
        concat!("Size of: ", stringify!(ph1_t))
    );
    assert_eq!(
        ::core::mem::align_of::<ph1_t>(),
        4usize,
        concat!("Alignment of ", stringify!(ph1_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ph1_t>())).format as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(ph1_t),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ph1_t>())).key_off as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(ph1_t),
            "::",
            stringify!(key_off)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ph1_t>())).tag_21a as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(ph1_t),
            "::",
            stringify!(tag_21a)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ph1_t>())).t_black as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(ph1_t),
            "::",
            stringify!(t_black)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ph1_t>())).split_col as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(ph1_t),
            "::",
            stringify!(split_col)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ph1_t>())).black_col as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(ph1_t),
            "::",
            stringify!(black_col)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ph1_t>())).split_row as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(ph1_t),
            "::",
            stringify!(split_row)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ph1_t>())).black_row as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(ph1_t),
            "::",
            stringify!(black_row)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<ph1_t>())).tag_210 as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(ph1_t),
            "::",
            stringify!(tag_210)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_dng_color_t {
    pub parsedfields: libc::c_uint,
    pub illuminant: ushort,
    pub calibration: [[f32; 4usize]; 4usize],
    pub colormatrix: [[f32; 3usize]; 4usize],
    pub forwardmatrix: [[f32; 4usize]; 3usize],
}
#[test]
fn bindgen_test_layout_libraw_dng_color_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_dng_color_t>(),
        168usize,
        concat!("Size of: ", stringify!(libraw_dng_color_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_dng_color_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_dng_color_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_dng_color_t>())).parsedfields as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_color_t),
            "::",
            stringify!(parsedfields)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_dng_color_t>())).illuminant as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_color_t),
            "::",
            stringify!(illuminant)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_dng_color_t>())).calibration as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_color_t),
            "::",
            stringify!(calibration)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_dng_color_t>())).colormatrix as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_color_t),
            "::",
            stringify!(colormatrix)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_dng_color_t>())).forwardmatrix as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_color_t),
            "::",
            stringify!(forwardmatrix)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_dng_levels_t {
    pub parsedfields: libc::c_uint,
    pub dng_cblack: [libc::c_uint; 4104usize],
    pub dng_black: libc::c_uint,
    pub dng_fcblack: [f32; 4104usize],
    pub dng_fblack: f32,
    pub dng_whitelevel: [libc::c_uint; 4usize],
    pub default_crop: [ushort; 4usize],
    pub user_crop: [f32; 4usize],
    pub preview_colorspace: libc::c_uint,
    pub analogbalance: [f32; 4usize],
    pub asshotneutral: [f32; 4usize],
    pub baseline_exposure: f32,
    pub LinearResponseLimit: f32,
}
#[test]
fn bindgen_test_layout_libraw_dng_levels_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_dng_levels_t>(),
        32928usize,
        concat!("Size of: ", stringify!(libraw_dng_levels_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_dng_levels_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_dng_levels_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_dng_levels_t>())).parsedfields as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(parsedfields)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_dng_levels_t>())).dng_cblack as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(dng_cblack)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_dng_levels_t>())).dng_black as *const _ as usize },
        16420usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(dng_black)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_dng_levels_t>())).dng_fcblack as *const _ as usize
        },
        16424usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(dng_fcblack)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_dng_levels_t>())).dng_fblack as *const _ as usize },
        32840usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(dng_fblack)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_dng_levels_t>())).dng_whitelevel as *const _ as usize
        },
        32844usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(dng_whitelevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_dng_levels_t>())).default_crop as *const _ as usize
        },
        32860usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(default_crop)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_dng_levels_t>())).user_crop as *const _ as usize },
        32868usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(user_crop)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_dng_levels_t>())).preview_colorspace as *const _ as usize
        },
        32884usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(preview_colorspace)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_dng_levels_t>())).analogbalance as *const _ as usize
        },
        32888usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(analogbalance)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_dng_levels_t>())).asshotneutral as *const _ as usize
        },
        32904usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(asshotneutral)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_dng_levels_t>())).baseline_exposure as *const _ as usize
        },
        32920usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(baseline_exposure)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_dng_levels_t>())).LinearResponseLimit as *const _
                as usize
        },
        32924usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_dng_levels_t),
            "::",
            stringify!(LinearResponseLimit)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_P1_color_t {
    pub romm_cam: [f32; 9usize],
}
#[test]
fn bindgen_test_layout_libraw_P1_color_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_P1_color_t>(),
        36usize,
        concat!("Size of: ", stringify!(libraw_P1_color_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_P1_color_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_P1_color_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_P1_color_t>())).romm_cam as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_P1_color_t),
            "::",
            stringify!(romm_cam)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_canon_makernotes_t {
    pub ColorDataVer: libc::c_int,
    pub ColorDataSubVer: libc::c_int,
    pub SpecularWhiteLevel: libc::c_int,
    pub NormalWhiteLevel: libc::c_int,
    pub ChannelBlackLevel: [libc::c_int; 4usize],
    pub AverageBlackLevel: libc::c_int,
    pub multishot: [libc::c_uint; 4usize],
    pub MeteringMode: libc::c_short,
    pub SpotMeteringMode: libc::c_short,
    pub FlashMeteringMode: uchar,
    pub FlashExposureLock: libc::c_short,
    pub ExposureMode: libc::c_short,
    pub AESetting: libc::c_short,
    pub ImageStabilization: libc::c_short,
    pub FlashMode: libc::c_short,
    pub FlashActivity: libc::c_short,
    pub FlashBits: libc::c_short,
    pub ManualFlashOutput: libc::c_short,
    pub FlashOutput: libc::c_short,
    pub FlashGuideNumber: libc::c_short,
    pub ContinuousDrive: libc::c_short,
    pub SensorWidth: libc::c_short,
    pub SensorHeight: libc::c_short,
    pub AFMicroAdjMode: libc::c_int,
    pub AFMicroAdjValue: f32,
    pub MakernotesFlip: libc::c_short,
    pub RecordMode: libc::c_short,
    pub SRAWQuality: libc::c_short,
    pub wbi: libc::c_uint,
    pub RF_lensID: libc::c_short,
    pub AutoLightingOptimizer: libc::c_int,
    pub HighlightTonePriority: libc::c_int,
    pub Quality: libc::c_short,
    pub CanonLog: libc::c_int,
    pub DefaultCropAbsolute: libraw_area_t,
    pub RecommendedImageArea: libraw_area_t,
    pub LeftOpticalBlack: libraw_area_t,
    pub UpperOpticalBlack: libraw_area_t,
    pub ActiveArea: libraw_area_t,
    pub ISOgain: [libc::c_short; 2usize],
}
#[test]
fn bindgen_test_layout_libraw_canon_makernotes_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_canon_makernotes_t>(),
        168usize,
        concat!("Size of: ", stringify!(libraw_canon_makernotes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_canon_makernotes_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_canon_makernotes_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).ColorDataVer as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(ColorDataVer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).ColorDataSubVer as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(ColorDataSubVer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).SpecularWhiteLevel as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(SpecularWhiteLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).NormalWhiteLevel as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(NormalWhiteLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).ChannelBlackLevel as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(ChannelBlackLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).AverageBlackLevel as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(AverageBlackLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).multishot as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(multishot)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).MeteringMode as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(MeteringMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).SpotMeteringMode as *const _
                as usize
        },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(SpotMeteringMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).FlashMeteringMode as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(FlashMeteringMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).FlashExposureLock as *const _
                as usize
        },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(FlashExposureLock)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).ExposureMode as *const _ as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(ExposureMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).AESetting as *const _ as usize
        },
        62usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(AESetting)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).ImageStabilization as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(ImageStabilization)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).FlashMode as *const _ as usize
        },
        66usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(FlashMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).FlashActivity as *const _
                as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(FlashActivity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).FlashBits as *const _ as usize
        },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(FlashBits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).ManualFlashOutput as *const _
                as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(ManualFlashOutput)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).FlashOutput as *const _ as usize
        },
        74usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(FlashOutput)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).FlashGuideNumber as *const _
                as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(FlashGuideNumber)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).ContinuousDrive as *const _
                as usize
        },
        78usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(ContinuousDrive)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).SensorWidth as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(SensorWidth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).SensorHeight as *const _ as usize
        },
        82usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(SensorHeight)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).AFMicroAdjMode as *const _
                as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(AFMicroAdjMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).AFMicroAdjValue as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(AFMicroAdjValue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).MakernotesFlip as *const _
                as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(MakernotesFlip)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).RecordMode as *const _ as usize
        },
        94usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(RecordMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).SRAWQuality as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(SRAWQuality)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).wbi as *const _ as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(wbi)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).RF_lensID as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(RF_lensID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).AutoLightingOptimizer as *const _
                as usize
        },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(AutoLightingOptimizer)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).HighlightTonePriority as *const _
                as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(HighlightTonePriority)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).Quality as *const _ as usize
        },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(Quality)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).CanonLog as *const _ as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(CanonLog)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).DefaultCropAbsolute as *const _
                as usize
        },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(DefaultCropAbsolute)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).RecommendedImageArea as *const _
                as usize
        },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(RecommendedImageArea)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).LeftOpticalBlack as *const _
                as usize
        },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(LeftOpticalBlack)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).UpperOpticalBlack as *const _
                as usize
        },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(UpperOpticalBlack)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).ActiveArea as *const _ as usize
        },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(ActiveArea)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_canon_makernotes_t>())).ISOgain as *const _ as usize
        },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_canon_makernotes_t),
            "::",
            stringify!(ISOgain)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_hasselblad_makernotes_t {
    pub BaseISO: libc::c_int,
    pub Gain: f64,
    pub Sensor: [libc::c_char; 8usize],
    pub SensorUnit: [libc::c_char; 64usize],
    pub HostBody: [libc::c_char; 64usize],
    pub SensorCode: libc::c_int,
    pub SensorSubCode: libc::c_int,
    pub CoatingCode: libc::c_int,
    pub uncropped: libc::c_int,
    pub CaptureSequenceInitiator: [libc::c_char; 32usize],
    pub SensorUnitConnector: [libc::c_char; 64usize],
    pub format: libc::c_int,
    pub nIFD_CM: [libc::c_int; 2usize],
    pub RecommendedCrop: [libc::c_int; 2usize],
    pub mnColorMatrix: [[f64; 3usize]; 4usize],
}
#[test]
fn bindgen_test_layout_libraw_hasselblad_makernotes_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_hasselblad_makernotes_t>(),
        384usize,
        concat!("Size of: ", stringify!(libraw_hasselblad_makernotes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_hasselblad_makernotes_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_hasselblad_makernotes_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_hasselblad_makernotes_t>())).BaseISO as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(BaseISO)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_hasselblad_makernotes_t>())).Gain as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(Gain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_hasselblad_makernotes_t>())).Sensor as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(Sensor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_hasselblad_makernotes_t>())).SensorUnit as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(SensorUnit)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_hasselblad_makernotes_t>())).HostBody as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(HostBody)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_hasselblad_makernotes_t>())).SensorCode as *const _
                as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(SensorCode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_hasselblad_makernotes_t>())).SensorSubCode as *const _
                as usize
        },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(SensorSubCode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_hasselblad_makernotes_t>())).CoatingCode as *const _
                as usize
        },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(CoatingCode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_hasselblad_makernotes_t>())).uncropped as *const _
                as usize
        },
        164usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(uncropped)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_hasselblad_makernotes_t>())).CaptureSequenceInitiator
                as *const _ as usize
        },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(CaptureSequenceInitiator)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_hasselblad_makernotes_t>())).SensorUnitConnector
                as *const _ as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(SensorUnitConnector)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_hasselblad_makernotes_t>())).format as *const _ as usize
        },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_hasselblad_makernotes_t>())).nIFD_CM as *const _ as usize
        },
        268usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(nIFD_CM)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_hasselblad_makernotes_t>())).RecommendedCrop as *const _
                as usize
        },
        276usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(RecommendedCrop)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_hasselblad_makernotes_t>())).mnColorMatrix as *const _
                as usize
        },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_hasselblad_makernotes_t),
            "::",
            stringify!(mnColorMatrix)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_fuji_info_t {
    pub ExpoMidPointShift: f32,
    pub DynamicRange: ushort,
    pub FilmMode: ushort,
    pub DynamicRangeSetting: ushort,
    pub DevelopmentDynamicRange: ushort,
    pub AutoDynamicRange: ushort,
    pub DRangePriority: ushort,
    pub DRangePriorityAuto: ushort,
    pub DRangePriorityFixed: ushort,
    pub BrightnessCompensation: f32,
    pub FocusMode: ushort,
    pub AFMode: ushort,
    pub FocusPixel: [ushort; 2usize],
    pub PrioritySettings: ushort,
    pub FocusSettings: libc::c_uint,
    pub AF_C_Settings: libc::c_uint,
    pub FocusWarning: ushort,
    pub ImageStabilization: [ushort; 3usize],
    pub FlashMode: ushort,
    pub WB_Preset: ushort,
    pub ShutterType: ushort,
    pub ExrMode: ushort,
    pub Macro: ushort,
    pub Rating: libc::c_uint,
    pub CropMode: ushort,
    pub SerialSignature: [libc::c_char; 13usize],
    pub SensorID: [libc::c_char; 5usize],
    pub RAFVersion: [libc::c_char; 5usize],
    pub RAFDataGeneration: libc::c_int,
    pub RAFDataVersion: ushort,
    pub isTSNERDTS: libc::c_int,
    pub DriveMode: libc::c_short,
    pub BlackLevel: [ushort; 9usize],
    pub RAFData_ImageSizeTable: [libc::c_uint; 32usize],
    pub AutoBracketing: libc::c_int,
    pub SequenceNumber: libc::c_int,
    pub SeriesLength: libc::c_int,
    pub PixelShiftOffset: [f32; 2usize],
    pub ImageCount: libc::c_int,
}
#[test]
fn bindgen_test_layout_libraw_fuji_info_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_fuji_info_t>(),
        280usize,
        concat!("Size of: ", stringify!(libraw_fuji_info_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_fuji_info_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_fuji_info_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).ExpoMidPointShift as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(ExpoMidPointShift)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).DynamicRange as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(DynamicRange)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_fuji_info_t>())).FilmMode as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(FilmMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).DynamicRangeSetting as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(DynamicRangeSetting)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).DevelopmentDynamicRange as *const _
                as usize
        },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(DevelopmentDynamicRange)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).AutoDynamicRange as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(AutoDynamicRange)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).DRangePriority as *const _ as usize
        },
        14usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(DRangePriority)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).DRangePriorityAuto as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(DRangePriorityAuto)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).DRangePriorityFixed as *const _ as usize
        },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(DRangePriorityFixed)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).BrightnessCompensation as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(BrightnessCompensation)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_fuji_info_t>())).FocusMode as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(FocusMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_fuji_info_t>())).AFMode as *const _ as usize },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(AFMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_fuji_info_t>())).FocusPixel as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(FocusPixel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).PrioritySettings as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(PrioritySettings)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).FocusSettings as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(FocusSettings)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).AF_C_Settings as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(AF_C_Settings)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).FocusWarning as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(FocusWarning)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).ImageStabilization as *const _ as usize
        },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(ImageStabilization)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_fuji_info_t>())).FlashMode as *const _ as usize },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(FlashMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_fuji_info_t>())).WB_Preset as *const _ as usize },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(WB_Preset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_fuji_info_t>())).ShutterType as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(ShutterType)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_fuji_info_t>())).ExrMode as *const _ as usize },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(ExrMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_fuji_info_t>())).Macro as *const _ as usize },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(Macro)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_fuji_info_t>())).Rating as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(Rating)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_fuji_info_t>())).CropMode as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(CropMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).SerialSignature as *const _ as usize
        },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(SerialSignature)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_fuji_info_t>())).SensorID as *const _ as usize },
        83usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(SensorID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_fuji_info_t>())).RAFVersion as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(RAFVersion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).RAFDataGeneration as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(RAFDataGeneration)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).RAFDataVersion as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(RAFDataVersion)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_fuji_info_t>())).isTSNERDTS as *const _ as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(isTSNERDTS)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_fuji_info_t>())).DriveMode as *const _ as usize },
        108usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(DriveMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_fuji_info_t>())).BlackLevel as *const _ as usize },
        110usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(BlackLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).RAFData_ImageSizeTable as *const _
                as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(RAFData_ImageSizeTable)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).AutoBracketing as *const _ as usize
        },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(AutoBracketing)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).SequenceNumber as *const _ as usize
        },
        260usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(SequenceNumber)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).SeriesLength as *const _ as usize
        },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(SeriesLength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_fuji_info_t>())).PixelShiftOffset as *const _ as usize
        },
        268usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(PixelShiftOffset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_fuji_info_t>())).ImageCount as *const _ as usize },
        276usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_fuji_info_t),
            "::",
            stringify!(ImageCount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_sensor_highspeed_crop_t {
    pub cleft: ushort,
    pub ctop: ushort,
    pub cwidth: ushort,
    pub cheight: ushort,
}
#[test]
fn bindgen_test_layout_libraw_sensor_highspeed_crop_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_sensor_highspeed_crop_t>(),
        8usize,
        concat!("Size of: ", stringify!(libraw_sensor_highspeed_crop_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_sensor_highspeed_crop_t>(),
        2usize,
        concat!("Alignment of ", stringify!(libraw_sensor_highspeed_crop_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sensor_highspeed_crop_t>())).cleft as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sensor_highspeed_crop_t),
            "::",
            stringify!(cleft)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sensor_highspeed_crop_t>())).ctop as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sensor_highspeed_crop_t),
            "::",
            stringify!(ctop)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sensor_highspeed_crop_t>())).cwidth as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sensor_highspeed_crop_t),
            "::",
            stringify!(cwidth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sensor_highspeed_crop_t>())).cheight as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sensor_highspeed_crop_t),
            "::",
            stringify!(cheight)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_nikon_makernotes_t {
    pub ExposureBracketValue: f64,
    pub ActiveDLighting: ushort,
    pub ShootingMode: ushort,
    pub ImageStabilization: [uchar; 7usize],
    pub VibrationReduction: uchar,
    pub VRMode: uchar,
    pub FlashSetting: [libc::c_char; 13usize],
    pub FlashType: [libc::c_char; 20usize],
    pub FlashExposureCompensation: [uchar; 4usize],
    pub ExternalFlashExposureComp: [uchar; 4usize],
    pub FlashExposureBracketValue: [uchar; 4usize],
    pub FlashMode: uchar,
    pub FlashExposureCompensation2: libc::c_schar,
    pub FlashExposureCompensation3: libc::c_schar,
    pub FlashExposureCompensation4: libc::c_schar,
    pub FlashSource: uchar,
    pub FlashFirmware: [uchar; 2usize],
    pub ExternalFlashFlags: uchar,
    pub FlashControlCommanderMode: uchar,
    pub FlashOutputAndCompensation: uchar,
    pub FlashFocalLength: uchar,
    pub FlashGNDistance: uchar,
    pub FlashGroupControlMode: [uchar; 4usize],
    pub FlashGroupOutputAndCompensation: [uchar; 4usize],
    pub FlashColorFilter: uchar,
    pub NEFCompression: ushort,
    pub ExposureMode: libc::c_int,
    pub ExposureProgram: libc::c_int,
    pub nMEshots: libc::c_int,
    pub MEgainOn: libc::c_int,
    pub ME_WB: [f64; 4usize],
    pub AFFineTune: uchar,
    pub AFFineTuneIndex: uchar,
    pub AFFineTuneAdj: i8,
    pub LensDataVersion: libc::c_uint,
    pub FlashInfoVersion: libc::c_uint,
    pub ColorBalanceVersion: libc::c_uint,
    pub key: uchar,
    pub NEFBitDepth: [ushort; 4usize],
    pub HighSpeedCropFormat: ushort,
    pub SensorHighSpeedCrop: libraw_sensor_highspeed_crop_t,
    pub SensorWidth: ushort,
    pub SensorHeight: ushort,
    pub Active_D_Lighting: ushort,
    pub ShotInfoVersion: libc::c_uint,
    pub MakernotesFlip: libc::c_short,
    pub RollAngle: f64,
    pub PitchAngle: f64,
    pub YawAngle: f64,
}
#[test]
fn bindgen_test_layout_libraw_nikon_makernotes_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_nikon_makernotes_t>(),
        224usize,
        concat!("Size of: ", stringify!(libraw_nikon_makernotes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_nikon_makernotes_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_nikon_makernotes_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).ExposureBracketValue as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ExposureBracketValue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).ActiveDLighting as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ActiveDLighting)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).ShootingMode as *const _ as usize
        },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ShootingMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).ImageStabilization as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ImageStabilization)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).VibrationReduction as *const _
                as usize
        },
        19usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(VibrationReduction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).VRMode as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(VRMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).FlashSetting as *const _ as usize
        },
        21usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashSetting)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).FlashType as *const _ as usize
        },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).FlashExposureCompensation
                as *const _ as usize
        },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashExposureCompensation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).ExternalFlashExposureComp
                as *const _ as usize
        },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ExternalFlashExposureComp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).FlashExposureBracketValue
                as *const _ as usize
        },
        62usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashExposureBracketValue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).FlashMode as *const _ as usize
        },
        66usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).FlashExposureCompensation2
                as *const _ as usize
        },
        67usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashExposureCompensation2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).FlashExposureCompensation3
                as *const _ as usize
        },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashExposureCompensation3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).FlashExposureCompensation4
                as *const _ as usize
        },
        69usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashExposureCompensation4)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).FlashSource as *const _ as usize
        },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashSource)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).FlashFirmware as *const _
                as usize
        },
        71usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashFirmware)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).ExternalFlashFlags as *const _
                as usize
        },
        73usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ExternalFlashFlags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).FlashControlCommanderMode
                as *const _ as usize
        },
        74usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashControlCommanderMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).FlashOutputAndCompensation
                as *const _ as usize
        },
        75usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashOutputAndCompensation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).FlashFocalLength as *const _
                as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashFocalLength)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).FlashGNDistance as *const _
                as usize
        },
        77usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashGNDistance)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).FlashGroupControlMode as *const _
                as usize
        },
        78usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashGroupControlMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).FlashGroupOutputAndCompensation
                as *const _ as usize
        },
        82usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashGroupOutputAndCompensation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).FlashColorFilter as *const _
                as usize
        },
        86usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashColorFilter)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).NEFCompression as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(NEFCompression)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).ExposureMode as *const _ as usize
        },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ExposureMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).ExposureProgram as *const _
                as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ExposureProgram)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).nMEshots as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(nMEshots)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).MEgainOn as *const _ as usize
        },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(MEgainOn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).ME_WB as *const _ as usize
        },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ME_WB)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).AFFineTune as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(AFFineTune)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).AFFineTuneIndex as *const _
                as usize
        },
        145usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(AFFineTuneIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).AFFineTuneAdj as *const _
                as usize
        },
        146usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(AFFineTuneAdj)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).LensDataVersion as *const _
                as usize
        },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(LensDataVersion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).FlashInfoVersion as *const _
                as usize
        },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(FlashInfoVersion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).ColorBalanceVersion as *const _
                as usize
        },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ColorBalanceVersion)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).key as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).NEFBitDepth as *const _ as usize
        },
        162usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(NEFBitDepth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).HighSpeedCropFormat as *const _
                as usize
        },
        170usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(HighSpeedCropFormat)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).SensorHighSpeedCrop as *const _
                as usize
        },
        172usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(SensorHighSpeedCrop)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).SensorWidth as *const _ as usize
        },
        180usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(SensorWidth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).SensorHeight as *const _ as usize
        },
        182usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(SensorHeight)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).Active_D_Lighting as *const _
                as usize
        },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(Active_D_Lighting)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).ShotInfoVersion as *const _
                as usize
        },
        188usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(ShotInfoVersion)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).MakernotesFlip as *const _
                as usize
        },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(MakernotesFlip)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).RollAngle as *const _ as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(RollAngle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).PitchAngle as *const _ as usize
        },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(PitchAngle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_nikon_makernotes_t>())).YawAngle as *const _ as usize
        },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_nikon_makernotes_t),
            "::",
            stringify!(YawAngle)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_olympus_makernotes_t {
    pub CameraType2: [libc::c_char; 6usize],
    pub ValidBits: ushort,
    pub SensorCalibration: [libc::c_int; 2usize],
    pub DriveMode: [ushort; 5usize],
    pub ColorSpace: ushort,
    pub FocusMode: [ushort; 2usize],
    pub AutoFocus: ushort,
    pub AFPoint: ushort,
    pub AFAreas: [libc::c_uint; 64usize],
    pub AFPointSelected: [f64; 5usize],
    pub AFResult: ushort,
    pub AFFineTune: uchar,
    pub AFFineTuneAdj: [libc::c_short; 3usize],
    pub SpecialMode: [libc::c_uint; 3usize],
    pub ZoomStepCount: ushort,
    pub FocusStepCount: ushort,
    pub FocusStepInfinity: ushort,
    pub FocusStepNear: ushort,
    pub FocusDistance: f64,
    pub AspectFrame: [ushort; 4usize],
    pub StackedImage: [libc::c_uint; 2usize],
    pub isLiveND: uchar,
    pub LiveNDfactor: libc::c_uint,
    pub Panorama_mode: ushort,
    pub Panorama_frameNum: ushort,
}
#[test]
fn bindgen_test_layout_libraw_olympus_makernotes_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_olympus_makernotes_t>(),
        408usize,
        concat!("Size of: ", stringify!(libraw_olympus_makernotes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_olympus_makernotes_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_olympus_makernotes_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).CameraType2 as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(CameraType2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).ValidBits as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(ValidBits)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).SensorCalibration as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(SensorCalibration)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).DriveMode as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(DriveMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).ColorSpace as *const _ as usize
        },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(ColorSpace)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).FocusMode as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(FocusMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).AutoFocus as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(AutoFocus)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).AFPoint as *const _ as usize
        },
        34usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(AFPoint)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).AFAreas as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(AFAreas)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).AFPointSelected as *const _
                as usize
        },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(AFPointSelected)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).AFResult as *const _ as usize
        },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(AFResult)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).AFFineTune as *const _ as usize
        },
        338usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(AFFineTune)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).AFFineTuneAdj as *const _
                as usize
        },
        340usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(AFFineTuneAdj)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).SpecialMode as *const _
                as usize
        },
        348usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(SpecialMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).ZoomStepCount as *const _
                as usize
        },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(ZoomStepCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).FocusStepCount as *const _
                as usize
        },
        362usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(FocusStepCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).FocusStepInfinity as *const _
                as usize
        },
        364usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(FocusStepInfinity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).FocusStepNear as *const _
                as usize
        },
        366usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(FocusStepNear)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).FocusDistance as *const _
                as usize
        },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(FocusDistance)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).AspectFrame as *const _
                as usize
        },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(AspectFrame)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).StackedImage as *const _
                as usize
        },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(StackedImage)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).isLiveND as *const _ as usize
        },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(isLiveND)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).LiveNDfactor as *const _
                as usize
        },
        396usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(LiveNDfactor)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).Panorama_mode as *const _
                as usize
        },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(Panorama_mode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_olympus_makernotes_t>())).Panorama_frameNum as *const _
                as usize
        },
        402usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_olympus_makernotes_t),
            "::",
            stringify!(Panorama_frameNum)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_panasonic_makernotes_t {
    pub Compression: ushort,
    pub BlackLevelDim: ushort,
    pub BlackLevel: [f32; 8usize],
    pub Multishot: libc::c_uint,
    pub gamma: f32,
    pub HighISOMultiplier: [libc::c_int; 3usize],
    pub FocusStepNear: libc::c_short,
    pub FocusStepCount: libc::c_short,
    pub ZoomPosition: libc::c_uint,
    pub LensManufacturer: libc::c_uint,
}
#[test]
fn bindgen_test_layout_libraw_panasonic_makernotes_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_panasonic_makernotes_t>(),
        68usize,
        concat!("Size of: ", stringify!(libraw_panasonic_makernotes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_panasonic_makernotes_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_panasonic_makernotes_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_panasonic_makernotes_t>())).Compression as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_panasonic_makernotes_t),
            "::",
            stringify!(Compression)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_panasonic_makernotes_t>())).BlackLevelDim as *const _
                as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_panasonic_makernotes_t),
            "::",
            stringify!(BlackLevelDim)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_panasonic_makernotes_t>())).BlackLevel as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_panasonic_makernotes_t),
            "::",
            stringify!(BlackLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_panasonic_makernotes_t>())).Multishot as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_panasonic_makernotes_t),
            "::",
            stringify!(Multishot)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_panasonic_makernotes_t>())).gamma as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_panasonic_makernotes_t),
            "::",
            stringify!(gamma)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_panasonic_makernotes_t>())).HighISOMultiplier as *const _
                as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_panasonic_makernotes_t),
            "::",
            stringify!(HighISOMultiplier)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_panasonic_makernotes_t>())).FocusStepNear as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_panasonic_makernotes_t),
            "::",
            stringify!(FocusStepNear)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_panasonic_makernotes_t>())).FocusStepCount as *const _
                as usize
        },
        58usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_panasonic_makernotes_t),
            "::",
            stringify!(FocusStepCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_panasonic_makernotes_t>())).ZoomPosition as *const _
                as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_panasonic_makernotes_t),
            "::",
            stringify!(ZoomPosition)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_panasonic_makernotes_t>())).LensManufacturer as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_panasonic_makernotes_t),
            "::",
            stringify!(LensManufacturer)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_pentax_makernotes_t {
    pub DriveMode: [uchar; 4usize],
    pub FocusMode: [ushort; 2usize],
    pub AFPointSelected: [ushort; 2usize],
    pub AFPointSelected_Area: ushort,
    pub AFPointsInFocus_version: libc::c_int,
    pub AFPointsInFocus: libc::c_uint,
    pub FocusPosition: ushort,
    pub AFAdjustment: libc::c_short,
    pub AFPointMode: uchar,
    pub MultiExposure: uchar,
    pub Quality: ushort,
}
#[test]
fn bindgen_test_layout_libraw_pentax_makernotes_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_pentax_makernotes_t>(),
        32usize,
        concat!("Size of: ", stringify!(libraw_pentax_makernotes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_pentax_makernotes_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_pentax_makernotes_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_pentax_makernotes_t>())).DriveMode as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(DriveMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_pentax_makernotes_t>())).FocusMode as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(FocusMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_pentax_makernotes_t>())).AFPointSelected as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(AFPointSelected)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_pentax_makernotes_t>())).AFPointSelected_Area as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(AFPointSelected_Area)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_pentax_makernotes_t>())).AFPointsInFocus_version
                as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(AFPointsInFocus_version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_pentax_makernotes_t>())).AFPointsInFocus as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(AFPointsInFocus)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_pentax_makernotes_t>())).FocusPosition as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(FocusPosition)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_pentax_makernotes_t>())).AFAdjustment as *const _
                as usize
        },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(AFAdjustment)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_pentax_makernotes_t>())).AFPointMode as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(AFPointMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_pentax_makernotes_t>())).MultiExposure as *const _
                as usize
        },
        29usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(MultiExposure)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_pentax_makernotes_t>())).Quality as *const _ as usize
        },
        30usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_pentax_makernotes_t),
            "::",
            stringify!(Quality)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_ricoh_makernotes_t {
    pub AFStatus: ushort,
    pub AFAreaXPosition: [libc::c_uint; 2usize],
    pub AFAreaYPosition: [libc::c_uint; 2usize],
    pub AFAreaMode: ushort,
    pub SensorWidth: libc::c_uint,
    pub SensorHeight: libc::c_uint,
    pub CroppedImageWidth: libc::c_uint,
    pub CroppedImageHeight: libc::c_uint,
    pub WideAdapter: ushort,
    pub CropMode: ushort,
    pub NDFilter: ushort,
    pub AutoBracketing: ushort,
    pub MacroMode: ushort,
    pub FlashMode: ushort,
    pub FlashExposureComp: f64,
    pub ManualFlashOutput: f64,
}
#[test]
fn bindgen_test_layout_libraw_ricoh_makernotes_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_ricoh_makernotes_t>(),
        72usize,
        concat!("Size of: ", stringify!(libraw_ricoh_makernotes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_ricoh_makernotes_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_ricoh_makernotes_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_ricoh_makernotes_t>())).AFStatus as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(AFStatus)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_ricoh_makernotes_t>())).AFAreaXPosition as *const _
                as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(AFAreaXPosition)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_ricoh_makernotes_t>())).AFAreaYPosition as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(AFAreaYPosition)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_ricoh_makernotes_t>())).AFAreaMode as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(AFAreaMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_ricoh_makernotes_t>())).SensorWidth as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(SensorWidth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_ricoh_makernotes_t>())).SensorHeight as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(SensorHeight)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_ricoh_makernotes_t>())).CroppedImageWidth as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(CroppedImageWidth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_ricoh_makernotes_t>())).CroppedImageHeight as *const _
                as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(CroppedImageHeight)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_ricoh_makernotes_t>())).WideAdapter as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(WideAdapter)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_ricoh_makernotes_t>())).CropMode as *const _ as usize
        },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(CropMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_ricoh_makernotes_t>())).NDFilter as *const _ as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(NDFilter)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_ricoh_makernotes_t>())).AutoBracketing as *const _
                as usize
        },
        46usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(AutoBracketing)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_ricoh_makernotes_t>())).MacroMode as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(MacroMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_ricoh_makernotes_t>())).FlashMode as *const _ as usize
        },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(FlashMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_ricoh_makernotes_t>())).FlashExposureComp as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(FlashExposureComp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_ricoh_makernotes_t>())).ManualFlashOutput as *const _
                as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_ricoh_makernotes_t),
            "::",
            stringify!(ManualFlashOutput)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_samsung_makernotes_t {
    pub ImageSizeFull: [libc::c_uint; 4usize],
    pub ImageSizeCrop: [libc::c_uint; 4usize],
    pub ColorSpace: [libc::c_int; 2usize],
    pub key: [libc::c_uint; 11usize],
    pub DigitalGain: f64,
    pub DeviceType: libc::c_int,
    pub LensFirmware: [libc::c_char; 32usize],
}
#[test]
fn bindgen_test_layout_libraw_samsung_makernotes_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_samsung_makernotes_t>(),
        136usize,
        concat!("Size of: ", stringify!(libraw_samsung_makernotes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_samsung_makernotes_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_samsung_makernotes_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_samsung_makernotes_t>())).ImageSizeFull as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_samsung_makernotes_t),
            "::",
            stringify!(ImageSizeFull)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_samsung_makernotes_t>())).ImageSizeCrop as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_samsung_makernotes_t),
            "::",
            stringify!(ImageSizeCrop)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_samsung_makernotes_t>())).ColorSpace as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_samsung_makernotes_t),
            "::",
            stringify!(ColorSpace)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_samsung_makernotes_t>())).key as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_samsung_makernotes_t),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_samsung_makernotes_t>())).DigitalGain as *const _
                as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_samsung_makernotes_t),
            "::",
            stringify!(DigitalGain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_samsung_makernotes_t>())).DeviceType as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_samsung_makernotes_t),
            "::",
            stringify!(DeviceType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_samsung_makernotes_t>())).LensFirmware as *const _
                as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_samsung_makernotes_t),
            "::",
            stringify!(LensFirmware)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_kodak_makernotes_t {
    pub BlackLevelTop: ushort,
    pub BlackLevelBottom: ushort,
    pub offset_left: libc::c_short,
    pub offset_top: libc::c_short,
    pub clipBlack: ushort,
    pub clipWhite: ushort,
    pub romm_camDaylight: [[f32; 3usize]; 3usize],
    pub romm_camTungsten: [[f32; 3usize]; 3usize],
    pub romm_camFluorescent: [[f32; 3usize]; 3usize],
    pub romm_camFlash: [[f32; 3usize]; 3usize],
    pub romm_camCustom: [[f32; 3usize]; 3usize],
    pub romm_camAuto: [[f32; 3usize]; 3usize],
    pub val018percent: ushort,
    pub val100percent: ushort,
    pub val170percent: ushort,
    pub MakerNoteKodak8a: libc::c_short,
    pub ISOCalibrationGain: f32,
    pub AnalogISO: f32,
}
#[test]
fn bindgen_test_layout_libraw_kodak_makernotes_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_kodak_makernotes_t>(),
        244usize,
        concat!("Size of: ", stringify!(libraw_kodak_makernotes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_kodak_makernotes_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_kodak_makernotes_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_kodak_makernotes_t>())).BlackLevelTop as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(BlackLevelTop)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_kodak_makernotes_t>())).BlackLevelBottom as *const _
                as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(BlackLevelBottom)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_kodak_makernotes_t>())).offset_left as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(offset_left)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_kodak_makernotes_t>())).offset_top as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(offset_top)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_kodak_makernotes_t>())).clipBlack as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(clipBlack)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_kodak_makernotes_t>())).clipWhite as *const _ as usize
        },
        10usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(clipWhite)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_kodak_makernotes_t>())).romm_camDaylight as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(romm_camDaylight)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_kodak_makernotes_t>())).romm_camTungsten as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(romm_camTungsten)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_kodak_makernotes_t>())).romm_camFluorescent as *const _
                as usize
        },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(romm_camFluorescent)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_kodak_makernotes_t>())).romm_camFlash as *const _
                as usize
        },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(romm_camFlash)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_kodak_makernotes_t>())).romm_camCustom as *const _
                as usize
        },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(romm_camCustom)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_kodak_makernotes_t>())).romm_camAuto as *const _ as usize
        },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(romm_camAuto)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_kodak_makernotes_t>())).val018percent as *const _
                as usize
        },
        228usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(val018percent)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_kodak_makernotes_t>())).val100percent as *const _
                as usize
        },
        230usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(val100percent)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_kodak_makernotes_t>())).val170percent as *const _
                as usize
        },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(val170percent)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_kodak_makernotes_t>())).MakerNoteKodak8a as *const _
                as usize
        },
        234usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(MakerNoteKodak8a)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_kodak_makernotes_t>())).ISOCalibrationGain as *const _
                as usize
        },
        236usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(ISOCalibrationGain)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_kodak_makernotes_t>())).AnalogISO as *const _ as usize
        },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_kodak_makernotes_t),
            "::",
            stringify!(AnalogISO)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_p1_makernotes_t {
    pub Software: [libc::c_char; 64usize],
    pub SystemType: [libc::c_char; 64usize],
    pub FirmwareString: [libc::c_char; 256usize],
    pub SystemModel: [libc::c_char; 64usize],
}
#[test]
fn bindgen_test_layout_libraw_p1_makernotes_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_p1_makernotes_t>(),
        448usize,
        concat!("Size of: ", stringify!(libraw_p1_makernotes_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_p1_makernotes_t>(),
        1usize,
        concat!("Alignment of ", stringify!(libraw_p1_makernotes_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_p1_makernotes_t>())).Software as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_p1_makernotes_t),
            "::",
            stringify!(Software)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_p1_makernotes_t>())).SystemType as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_p1_makernotes_t),
            "::",
            stringify!(SystemType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_p1_makernotes_t>())).FirmwareString as *const _ as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_p1_makernotes_t),
            "::",
            stringify!(FirmwareString)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_p1_makernotes_t>())).SystemModel as *const _ as usize
        },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_p1_makernotes_t),
            "::",
            stringify!(SystemModel)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_sony_info_t {
    pub CameraType: ushort,
    pub Sony0x9400_version: uchar,
    pub Sony0x9400_ReleaseMode2: uchar,
    pub Sony0x9400_SequenceImageNumber: libc::c_uint,
    pub Sony0x9400_SequenceLength1: uchar,
    pub Sony0x9400_SequenceFileNumber: libc::c_uint,
    pub Sony0x9400_SequenceLength2: uchar,
    pub AFAreaModeSetting: u8,
    pub AFAreaMode: u16,
    pub FlexibleSpotPosition: [ushort; 2usize],
    pub AFPointSelected: u8,
    pub AFPointSelected_0x201e: u8,
    pub nAFPointsUsed: libc::c_short,
    pub AFPointsUsed: [u8; 10usize],
    pub AFTracking: u8,
    pub AFType: u8,
    pub FocusLocation: [ushort; 4usize],
    pub FocusPosition: ushort,
    pub AFMicroAdjValue: i8,
    pub AFMicroAdjOn: i8,
    pub AFMicroAdjRegisteredLenses: uchar,
    pub VariableLowPassFilter: ushort,
    pub LongExposureNoiseReduction: libc::c_uint,
    pub HighISONoiseReduction: ushort,
    pub HDR: [ushort; 2usize],
    pub group2010: ushort,
    pub group9050: ushort,
    pub real_iso_offset: ushort,
    pub MeteringMode_offset: ushort,
    pub ExposureProgram_offset: ushort,
    pub ReleaseMode2_offset: ushort,
    pub MinoltaCamID: libc::c_uint,
    pub firmware: f32,
    pub ImageCount3_offset: ushort,
    pub ImageCount3: libc::c_uint,
    pub ElectronicFrontCurtainShutter: libc::c_uint,
    pub MeteringMode2: ushort,
    pub SonyDateTime: [libc::c_char; 20usize],
    pub ShotNumberSincePowerUp: libc::c_uint,
    pub PixelShiftGroupPrefix: ushort,
    pub PixelShiftGroupID: libc::c_uint,
    pub nShotsInPixelShiftGroup: libc::c_char,
    pub numInPixelShiftGroup: libc::c_char,
    pub prd_ImageHeight: ushort,
    pub prd_ImageWidth: ushort,
    pub prd_Total_bps: ushort,
    pub prd_Active_bps: ushort,
    pub prd_StorageMethod: ushort,
    pub prd_BayerPattern: ushort,
    pub SonyRawFileType: ushort,
    pub RAWFileType: ushort,
    pub Quality: libc::c_uint,
    pub FileFormat: ushort,
    pub MetaVersion: [libc::c_char; 16usize],
}
#[test]
fn bindgen_test_layout_libraw_sony_info_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_sony_info_t>(),
        180usize,
        concat!("Size of: ", stringify!(libraw_sony_info_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_sony_info_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_sony_info_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_sony_info_t>())).CameraType as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(CameraType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).Sony0x9400_version as *const _ as usize
        },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(Sony0x9400_version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).Sony0x9400_ReleaseMode2 as *const _
                as usize
        },
        3usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(Sony0x9400_ReleaseMode2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).Sony0x9400_SequenceImageNumber
                as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(Sony0x9400_SequenceImageNumber)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).Sony0x9400_SequenceLength1 as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(Sony0x9400_SequenceLength1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).Sony0x9400_SequenceFileNumber
                as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(Sony0x9400_SequenceFileNumber)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).Sony0x9400_SequenceLength2 as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(Sony0x9400_SequenceLength2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).AFAreaModeSetting as *const _ as usize
        },
        17usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(AFAreaModeSetting)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_sony_info_t>())).AFAreaMode as *const _ as usize },
        18usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(AFAreaMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).FlexibleSpotPosition as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(FlexibleSpotPosition)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).AFPointSelected as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(AFPointSelected)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).AFPointSelected_0x201e as *const _
                as usize
        },
        25usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(AFPointSelected_0x201e)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).nAFPointsUsed as *const _ as usize
        },
        26usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(nAFPointsUsed)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).AFPointsUsed as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(AFPointsUsed)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_sony_info_t>())).AFTracking as *const _ as usize },
        38usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(AFTracking)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_sony_info_t>())).AFType as *const _ as usize },
        39usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(AFType)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).FocusLocation as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(FocusLocation)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).FocusPosition as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(FocusPosition)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).AFMicroAdjValue as *const _ as usize
        },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(AFMicroAdjValue)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).AFMicroAdjOn as *const _ as usize
        },
        51usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(AFMicroAdjOn)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).AFMicroAdjRegisteredLenses as *const _
                as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(AFMicroAdjRegisteredLenses)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).VariableLowPassFilter as *const _
                as usize
        },
        54usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(VariableLowPassFilter)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).LongExposureNoiseReduction as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(LongExposureNoiseReduction)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).HighISONoiseReduction as *const _
                as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(HighISONoiseReduction)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_sony_info_t>())).HDR as *const _ as usize },
        62usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(HDR)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_sony_info_t>())).group2010 as *const _ as usize },
        66usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(group2010)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_sony_info_t>())).group9050 as *const _ as usize },
        68usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(group9050)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).real_iso_offset as *const _ as usize
        },
        70usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(real_iso_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).MeteringMode_offset as *const _ as usize
        },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(MeteringMode_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).ExposureProgram_offset as *const _
                as usize
        },
        74usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(ExposureProgram_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).ReleaseMode2_offset as *const _ as usize
        },
        76usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(ReleaseMode2_offset)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).MinoltaCamID as *const _ as usize
        },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(MinoltaCamID)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_sony_info_t>())).firmware as *const _ as usize },
        84usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(firmware)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).ImageCount3_offset as *const _ as usize
        },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(ImageCount3_offset)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_sony_info_t>())).ImageCount3 as *const _ as usize },
        92usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(ImageCount3)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).ElectronicFrontCurtainShutter
                as *const _ as usize
        },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(ElectronicFrontCurtainShutter)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).MeteringMode2 as *const _ as usize
        },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(MeteringMode2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).SonyDateTime as *const _ as usize
        },
        102usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(SonyDateTime)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).ShotNumberSincePowerUp as *const _
                as usize
        },
        124usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(ShotNumberSincePowerUp)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).PixelShiftGroupPrefix as *const _
                as usize
        },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(PixelShiftGroupPrefix)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).PixelShiftGroupID as *const _ as usize
        },
        132usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(PixelShiftGroupID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).nShotsInPixelShiftGroup as *const _
                as usize
        },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(nShotsInPixelShiftGroup)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).numInPixelShiftGroup as *const _
                as usize
        },
        137usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(numInPixelShiftGroup)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).prd_ImageHeight as *const _ as usize
        },
        138usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(prd_ImageHeight)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).prd_ImageWidth as *const _ as usize
        },
        140usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(prd_ImageWidth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).prd_Total_bps as *const _ as usize
        },
        142usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(prd_Total_bps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).prd_Active_bps as *const _ as usize
        },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(prd_Active_bps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).prd_StorageMethod as *const _ as usize
        },
        146usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(prd_StorageMethod)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).prd_BayerPattern as *const _ as usize
        },
        148usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(prd_BayerPattern)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_sony_info_t>())).SonyRawFileType as *const _ as usize
        },
        150usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(SonyRawFileType)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_sony_info_t>())).RAWFileType as *const _ as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(RAWFileType)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_sony_info_t>())).Quality as *const _ as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(Quality)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_sony_info_t>())).FileFormat as *const _ as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(FileFormat)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_sony_info_t>())).MetaVersion as *const _ as usize },
        162usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_sony_info_t),
            "::",
            stringify!(MetaVersion)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_colordata_t {
    pub curve: [ushort; 65536usize],
    pub cblack: [libc::c_uint; 4104usize],
    pub black: libc::c_uint,
    pub data_maximum: libc::c_uint,
    pub maximum: libc::c_uint,
    pub linear_max: [libc::c_long; 4usize],
    pub fmaximum: f32,
    pub fnorm: f32,
    pub white: [[ushort; 8usize]; 8usize],
    pub cam_mul: [f32; 4usize],
    pub pre_mul: [f32; 4usize],
    pub cmatrix: [[f32; 4usize]; 3usize],
    pub ccm: [[f32; 4usize]; 3usize],
    pub rgb_cam: [[f32; 4usize]; 3usize],
    pub cam_xyz: [[f32; 3usize]; 4usize],
    pub phase_one_data: ph1_t,
    pub flash_used: f32,
    pub canon_ev: f32,
    pub model2: [libc::c_char; 64usize],
    pub UniqueCameraModel: [libc::c_char; 64usize],
    pub LocalizedCameraModel: [libc::c_char; 64usize],
    pub ImageUniqueID: [libc::c_char; 64usize],
    pub RawDataUniqueID: [libc::c_char; 17usize],
    pub OriginalRawFileName: [libc::c_char; 64usize],
    pub profile: *mut libc::c_void,
    pub profile_length: libc::c_uint,
    pub black_stat: [libc::c_uint; 8usize],
    pub dng_color: [libraw_dng_color_t; 2usize],
    pub dng_levels: libraw_dng_levels_t,
    pub WB_Coeffs: [[libc::c_int; 4usize]; 256usize],
    pub WBCT_Coeffs: [[f32; 5usize]; 64usize],
    pub as_shot_wb_applied: libc::c_int,
    pub P1_color: [libraw_P1_color_t; 2usize],
    pub raw_bps: libc::c_uint,
    pub ExifColorSpace: libc::c_int,
}
#[test]
fn bindgen_test_layout_libraw_colordata_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_colordata_t>(),
        187032usize,
        concat!("Size of: ", stringify!(libraw_colordata_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_colordata_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_colordata_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).curve as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(curve)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).cblack as *const _ as usize },
        131072usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(cblack)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).black as *const _ as usize },
        147488usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(black)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_colordata_t>())).data_maximum as *const _ as usize
        },
        147492usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(data_maximum)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).maximum as *const _ as usize },
        147496usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(maximum)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).linear_max as *const _ as usize },
        147500usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(linear_max)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).fmaximum as *const _ as usize },
        147516usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(fmaximum)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).fnorm as *const _ as usize },
        147520usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(fnorm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).white as *const _ as usize },
        147524usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(white)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).cam_mul as *const _ as usize },
        147652usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(cam_mul)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).pre_mul as *const _ as usize },
        147668usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(pre_mul)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).cmatrix as *const _ as usize },
        147684usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(cmatrix)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).ccm as *const _ as usize },
        147732usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(ccm)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).rgb_cam as *const _ as usize },
        147780usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(rgb_cam)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).cam_xyz as *const _ as usize },
        147828usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(cam_xyz)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_colordata_t>())).phase_one_data as *const _ as usize
        },
        147876usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(phase_one_data)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).flash_used as *const _ as usize },
        147912usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(flash_used)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).canon_ev as *const _ as usize },
        147916usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(canon_ev)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).model2 as *const _ as usize },
        147920usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(model2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_colordata_t>())).UniqueCameraModel as *const _ as usize
        },
        147984usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(UniqueCameraModel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_colordata_t>())).LocalizedCameraModel as *const _
                as usize
        },
        148048usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(LocalizedCameraModel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_colordata_t>())).ImageUniqueID as *const _ as usize
        },
        148112usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(ImageUniqueID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_colordata_t>())).RawDataUniqueID as *const _ as usize
        },
        148176usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(RawDataUniqueID)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_colordata_t>())).OriginalRawFileName as *const _ as usize
        },
        148193usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(OriginalRawFileName)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).profile as *const _ as usize },
        148264usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(profile)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_colordata_t>())).profile_length as *const _ as usize
        },
        148272usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(profile_length)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).black_stat as *const _ as usize },
        148276usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(black_stat)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).dng_color as *const _ as usize },
        148308usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(dng_color)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).dng_levels as *const _ as usize },
        148644usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(dng_levels)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).WB_Coeffs as *const _ as usize },
        181572usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(WB_Coeffs)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).WBCT_Coeffs as *const _ as usize },
        185668usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(WBCT_Coeffs)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_colordata_t>())).as_shot_wb_applied as *const _ as usize
        },
        186948usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(as_shot_wb_applied)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).P1_color as *const _ as usize },
        186952usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(P1_color)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_colordata_t>())).raw_bps as *const _ as usize },
        187024usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(raw_bps)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_colordata_t>())).ExifColorSpace as *const _ as usize
        },
        187028usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_colordata_t),
            "::",
            stringify!(ExifColorSpace)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_thumbnail_t {
    pub tformat: LibRaw_thumbnail_formats,
    pub twidth: ushort,
    pub theight: ushort,
    pub tlength: libc::c_uint,
    pub tcolors: libc::c_int,
    pub thumb: *mut libc::c_char,
}
#[test]
fn bindgen_test_layout_libraw_thumbnail_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_thumbnail_t>(),
        24usize,
        concat!("Size of: ", stringify!(libraw_thumbnail_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_thumbnail_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_thumbnail_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_thumbnail_t>())).tformat as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_thumbnail_t),
            "::",
            stringify!(tformat)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_thumbnail_t>())).twidth as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_thumbnail_t),
            "::",
            stringify!(twidth)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_thumbnail_t>())).theight as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_thumbnail_t),
            "::",
            stringify!(theight)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_thumbnail_t>())).tlength as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_thumbnail_t),
            "::",
            stringify!(tlength)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_thumbnail_t>())).tcolors as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_thumbnail_t),
            "::",
            stringify!(tcolors)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_thumbnail_t>())).thumb as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_thumbnail_t),
            "::",
            stringify!(thumb)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_thumbnail_item_t {
    pub tformat: LibRaw_internal_thumbnail_formats,
    pub twidth: ushort,
    pub theight: ushort,
    pub tflip: ushort,
    pub tlength: libc::c_uint,
    pub tmisc: libc::c_uint,
    pub toffset: INT64,
}
#[test]
fn bindgen_test_layout_libraw_thumbnail_item_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_thumbnail_item_t>(),
        32usize,
        concat!("Size of: ", stringify!(libraw_thumbnail_item_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_thumbnail_item_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_thumbnail_item_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_thumbnail_item_t>())).tformat as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_thumbnail_item_t),
            "::",
            stringify!(tformat)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_thumbnail_item_t>())).twidth as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_thumbnail_item_t),
            "::",
            stringify!(twidth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_thumbnail_item_t>())).theight as *const _ as usize
        },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_thumbnail_item_t),
            "::",
            stringify!(theight)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_thumbnail_item_t>())).tflip as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_thumbnail_item_t),
            "::",
            stringify!(tflip)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_thumbnail_item_t>())).tlength as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_thumbnail_item_t),
            "::",
            stringify!(tlength)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_thumbnail_item_t>())).tmisc as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_thumbnail_item_t),
            "::",
            stringify!(tmisc)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_thumbnail_item_t>())).toffset as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_thumbnail_item_t),
            "::",
            stringify!(toffset)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_thumbnail_list_t {
    pub thumbcount: libc::c_int,
    pub thumblist: [libraw_thumbnail_item_t; 8usize],
}
#[test]
fn bindgen_test_layout_libraw_thumbnail_list_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_thumbnail_list_t>(),
        264usize,
        concat!("Size of: ", stringify!(libraw_thumbnail_list_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_thumbnail_list_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_thumbnail_list_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_thumbnail_list_t>())).thumbcount as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_thumbnail_list_t),
            "::",
            stringify!(thumbcount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_thumbnail_list_t>())).thumblist as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_thumbnail_list_t),
            "::",
            stringify!(thumblist)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_gps_info_t {
    pub latitude: [f32; 3usize],
    pub longitude: [f32; 3usize],
    pub gpstimestamp: [f32; 3usize],
    pub altitude: f32,
    pub altref: libc::c_char,
    pub latref: libc::c_char,
    pub longref: libc::c_char,
    pub gpsstatus: libc::c_char,
    pub gpsparsed: libc::c_char,
}
#[test]
fn bindgen_test_layout_libraw_gps_info_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_gps_info_t>(),
        48usize,
        concat!("Size of: ", stringify!(libraw_gps_info_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_gps_info_t>(),
        4usize,
        concat!("Alignment of ", stringify!(libraw_gps_info_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_gps_info_t>())).latitude as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_gps_info_t),
            "::",
            stringify!(latitude)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_gps_info_t>())).longitude as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_gps_info_t),
            "::",
            stringify!(longitude)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_gps_info_t>())).gpstimestamp as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_gps_info_t),
            "::",
            stringify!(gpstimestamp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_gps_info_t>())).altitude as *const _ as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_gps_info_t),
            "::",
            stringify!(altitude)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_gps_info_t>())).altref as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_gps_info_t),
            "::",
            stringify!(altref)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_gps_info_t>())).latref as *const _ as usize },
        41usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_gps_info_t),
            "::",
            stringify!(latref)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_gps_info_t>())).longref as *const _ as usize },
        42usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_gps_info_t),
            "::",
            stringify!(longref)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_gps_info_t>())).gpsstatus as *const _ as usize },
        43usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_gps_info_t),
            "::",
            stringify!(gpsstatus)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_gps_info_t>())).gpsparsed as *const _ as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_gps_info_t),
            "::",
            stringify!(gpsparsed)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_imgother_t {
    pub iso_speed: f32,
    pub shutter: f32,
    pub aperture: f32,
    pub focal_len: f32,
    pub timestamp: time_t,
    pub shot_order: libc::c_uint,
    pub gpsdata: [libc::c_uint; 32usize],
    pub parsed_gps: libraw_gps_info_t,
    pub desc: [libc::c_char; 512usize],
    pub artist: [libc::c_char; 64usize],
    pub analogbalance: [f32; 4usize],
}
#[test]
fn bindgen_test_layout_libraw_imgother_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_imgother_t>(),
        800usize,
        concat!("Size of: ", stringify!(libraw_imgother_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_imgother_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_imgother_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_imgother_t>())).iso_speed as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_imgother_t),
            "::",
            stringify!(iso_speed)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_imgother_t>())).shutter as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_imgother_t),
            "::",
            stringify!(shutter)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_imgother_t>())).aperture as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_imgother_t),
            "::",
            stringify!(aperture)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_imgother_t>())).focal_len as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_imgother_t),
            "::",
            stringify!(focal_len)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_imgother_t>())).timestamp as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_imgother_t),
            "::",
            stringify!(timestamp)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_imgother_t>())).shot_order as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_imgother_t),
            "::",
            stringify!(shot_order)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_imgother_t>())).gpsdata as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_imgother_t),
            "::",
            stringify!(gpsdata)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_imgother_t>())).parsed_gps as *const _ as usize },
        156usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_imgother_t),
            "::",
            stringify!(parsed_gps)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_imgother_t>())).desc as *const _ as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_imgother_t),
            "::",
            stringify!(desc)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_imgother_t>())).artist as *const _ as usize },
        716usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_imgother_t),
            "::",
            stringify!(artist)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_imgother_t>())).analogbalance as *const _ as usize
        },
        780usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_imgother_t),
            "::",
            stringify!(analogbalance)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq, Eq)]
pub struct libraw_afinfo_item_t {
    pub AFInfoData_tag: libc::c_uint,
    pub AFInfoData_order: libc::c_short,
    pub AFInfoData_version: libc::c_uint,
    pub AFInfoData_length: libc::c_uint,
    pub AFInfoData: *mut uchar,
}
#[test]
fn bindgen_test_layout_libraw_afinfo_item_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_afinfo_item_t>(),
        24usize,
        concat!("Size of: ", stringify!(libraw_afinfo_item_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_afinfo_item_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_afinfo_item_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_afinfo_item_t>())).AFInfoData_tag as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_afinfo_item_t),
            "::",
            stringify!(AFInfoData_tag)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_afinfo_item_t>())).AFInfoData_order as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_afinfo_item_t),
            "::",
            stringify!(AFInfoData_order)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_afinfo_item_t>())).AFInfoData_version as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_afinfo_item_t),
            "::",
            stringify!(AFInfoData_version)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_afinfo_item_t>())).AFInfoData_length as *const _ as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_afinfo_item_t),
            "::",
            stringify!(AFInfoData_length)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_afinfo_item_t>())).AFInfoData as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_afinfo_item_t),
            "::",
            stringify!(AFInfoData)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_metadata_common_t {
    pub FlashEC: f32,
    pub FlashGN: f32,
    pub CameraTemperature: f32,
    pub SensorTemperature: f32,
    pub SensorTemperature2: f32,
    pub LensTemperature: f32,
    pub AmbientTemperature: f32,
    pub BatteryTemperature: f32,
    pub exifAmbientTemperature: f32,
    pub exifHumidity: f32,
    pub exifPressure: f32,
    pub exifWaterDepth: f32,
    pub exifAcceleration: f32,
    pub exifCameraElevationAngle: f32,
    pub real_ISO: f32,
    pub exifExposureIndex: f32,
    pub ColorSpace: ushort,
    pub firmware: [libc::c_char; 128usize],
    pub ExposureCalibrationShift: f32,
    pub afdata: [libraw_afinfo_item_t; 4usize],
    pub afcount: libc::c_int,
}
#[test]
fn bindgen_test_layout_libraw_metadata_common_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_metadata_common_t>(),
        304usize,
        concat!("Size of: ", stringify!(libraw_metadata_common_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_metadata_common_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_metadata_common_t))
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_metadata_common_t>())).FlashEC as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_metadata_common_t),
            "::",
            stringify!(FlashEC)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_metadata_common_t>())).FlashGN as *const _ as usize
        },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_metadata_common_t),
            "::",
            stringify!(FlashGN)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_metadata_common_t>())).CameraTemperature as *const _
                as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_metadata_common_t),
            "::",
            stringify!(CameraTemperature)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_metadata_common_t>())).SensorTemperature as *const _
                as usize
        },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_metadata_common_t),
            "::",
            stringify!(SensorTemperature)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_metadata_common_t>())).SensorTemperature2 as *const _
                as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_metadata_common_t),
            "::",
            stringify!(SensorTemperature2)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_metadata_common_t>())).LensTemperature as *const _
                as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_metadata_common_t),
            "::",
            stringify!(LensTemperature)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_metadata_common_t>())).AmbientTemperature as *const _
                as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_metadata_common_t),
            "::",
            stringify!(AmbientTemperature)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_metadata_common_t>())).BatteryTemperature as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_metadata_common_t),
            "::",
            stringify!(BatteryTemperature)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_metadata_common_t>())).exifAmbientTemperature as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_metadata_common_t),
            "::",
            stringify!(exifAmbientTemperature)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_metadata_common_t>())).exifHumidity as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_metadata_common_t),
            "::",
            stringify!(exifHumidity)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_metadata_common_t>())).exifPressure as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_metadata_common_t),
            "::",
            stringify!(exifPressure)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_metadata_common_t>())).exifWaterDepth as *const _
                as usize
        },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_metadata_common_t),
            "::",
            stringify!(exifWaterDepth)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_metadata_common_t>())).exifAcceleration as *const _
                as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_metadata_common_t),
            "::",
            stringify!(exifAcceleration)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_metadata_common_t>())).exifCameraElevationAngle
                as *const _ as usize
        },
        52usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_metadata_common_t),
            "::",
            stringify!(exifCameraElevationAngle)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_metadata_common_t>())).real_ISO as *const _ as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_metadata_common_t),
            "::",
            stringify!(real_ISO)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_metadata_common_t>())).exifExposureIndex as *const _
                as usize
        },
        60usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_metadata_common_t),
            "::",
            stringify!(exifExposureIndex)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_metadata_common_t>())).ColorSpace as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_metadata_common_t),
            "::",
            stringify!(ColorSpace)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_metadata_common_t>())).firmware as *const _ as usize
        },
        66usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_metadata_common_t),
            "::",
            stringify!(firmware)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_metadata_common_t>())).ExposureCalibrationShift
                as *const _ as usize
        },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_metadata_common_t),
            "::",
            stringify!(ExposureCalibrationShift)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_metadata_common_t>())).afdata as *const _ as usize
        },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_metadata_common_t),
            "::",
            stringify!(afdata)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::core::ptr::null::<libraw_metadata_common_t>())).afcount as *const _ as usize
        },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_metadata_common_t),
            "::",
            stringify!(afcount)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct libraw_output_params_t {
    pub greybox: [libc::c_uint; 4usize],
    pub cropbox: [libc::c_uint; 4usize],
    pub aber: [f64; 4usize],
    pub gamm: [f64; 6usize],
    pub user_mul: [f32; 4usize],
    pub bright: f32,
    pub threshold: f32,
    pub half_size: libc::c_int,
    pub four_color_rgb: libc::c_int,
    pub highlight: libc::c_int,
    pub use_auto_wb: libc::c_int,
    pub use_camera_wb: libc::c_int,
    pub use_camera_matrix: libc::c_int,
    pub output_color: libc::c_int,
    pub output_profile: *mut libc::c_char,
    pub camera_profile: *mut libc::c_char,
    pub bad_pixels: *mut libc::c_char,
    pub dark_frame: *mut libc::c_char,
    pub output_bps: libc::c_int,
    pub output_tiff: libc::c_int,
    pub output_flags: libc::c_int,
    pub user_flip: libc::c_int,
    pub user_qual: libc::c_int,
    pub user_black: libc::c_int,
    pub user_cblack: [libc::c_int; 4usize],
    pub user_sat: libc::c_int,
    pub med_passes: libc::c_int,
    pub auto_bright_thr: f32,
    pub adjust_maximum_thr: f32,
    pub no_auto_bright: libc::c_int,
    pub use_fuji_rotate: libc::c_int,
    pub green_matching: libc::c_int,
    pub dcb_iterations: libc::c_int,
    pub dcb_enhance_fl: libc::c_int,
    pub fbdd_noiserd: libc::c_int,
    pub exp_correc: libc::c_int,
    pub exp_shift: f32,
    pub exp_preser: f32,
    pub no_auto_scale: libc::c_int,
    pub no_interpolation: libc::c_int,
}
#[test]
fn bindgen_test_layout_libraw_output_params_t() {
    assert_eq!(
        ::core::mem::size_of::<libraw_output_params_t>(),
        304usize,
        concat!("Size of: ", stringify!(libraw_output_params_t))
    );
    assert_eq!(
        ::core::mem::align_of::<libraw_output_params_t>(),
        8usize,
        concat!("Alignment of ", stringify!(libraw_output_params_t))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_output_params_t>())).greybox as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(libraw_output_params_t),
            "::",
            stringify!(greybox)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<libraw_output_params_t>())).cropbox as *const _ as usize },
        16usize,
        concat!(
